[½º¸¶Æ® Æ÷ÀÎÅÍ]

½º¸¶Æ®Æ÷ÀÎÅÍ´Â c++ÀÇ Æ¯º°ÇÑ Å¬·¡½º Å¸ÀÔÀ¸·Î, Æ÷ÀÎÅÍÃ³·³ µ¿ÀÛÇÏÁö¸¸ ½º½º·Î ¸Ş¸ğ¸®¸¦ °ü¸®ÇÑ´Ù.
ÀÌ´Â ¸Ş¸ğ¸® ´©¼ö¸¦ ¹æÁöÇÏ°í, ¸Ş¸ğ¸® °ü¸®ÀÇ º¹Àâ¼ºÀ» ÁÙ¿©ÁØ´Ù. ½º¸¶Æ® Æ÷ÀÎÅÍ´Â °´Ã¼°¡ ´õ ÀÌ»ó ÇÊ¿äÇÏÁö ¾ÊÀ» ¶§
ÀÚµ¿À¸·Î »èÁ¦ÇÏ¸ç, ÀÌ·¯ÇÑ ±â´É ¶§¹®¿¡ '½º¸¶Æ®'¶ó°í ºÎ¸¥´Ù. ½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ÇÊ¿ä¼º, »ç¿ë ÀÌÀ¯, ±×¸®°í ÀÛµ¿ 
¿ø¸®¿¡ ´ëÇØ ÀÚ¼¼È÷ ¾Ë¾Æº¸µµ·Ï ÇÏÀÚ.

1. ½º¸¶Æ® Æ÷ÀÎÅÍ¶õ?

½º¸¶Æ® Æ÷ÀÎÅÍ(smart pointer)´Â C++¿¡¼­ Á¦°øÇÏ´Â Æ÷ÀÎÅÍÀÇ ÇÑ ÇüÅÂÀÌ´Ù.
±×·¯³ª ÀÏ¹İ Æ÷ÀÎÅÍ¿Í´Â ´Ù¸£°Ô '½º¸¶Æ®'ÇÑ ±â´ÉÀ» °¡Áö°í ÀÖ´Ù. ±×·¸´Ù¸é ÀÌ '½º¸¶Æ®'ÇÑ ±â´ÉÀÌ ¹»±î?
¹Ù·Î ÀÚµ¿ ¸Ş¸ğ¸® °ü¸®ÀÌ´Ù.

ÀÏ¹İÀûÀ¸·Î c++¿¡¼­ µ¿Àû ¸Ş¸ğ¸®¸¦ ÇÒ´çÇÏ¸é ÇÁ·Î±×·¡¸Ó´Â ±× ¸Ş¸ğ¸®¸¦ Á÷Á¢ ÇØÁ¦ÇØ¾ß ÇÑ´Ù. ÀÌ¸¦ ÀØ¾î¹ö¸®¸é ¸Ş¸ğ¸®
´©¼ö°¡ ¹ß»ıÇÏ°Ô µÇ°í, ÀÌ´Â ÇÁ·Î±×·¥ÀÇ ¼º´ÉÀ» ÀúÇÏ½ÃÅ°´Â ÁÖ¿äÇÑ ¿øÀÎÀÌ µÈ´Ù. ¶ÇÇÑ ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÑ ÈÄ¿¡ ±×
¸Ş¸ğ¸®¸¦ ´Ù½Ã »ç¿ëÇÏ·Á°í ÇÏ´Â 'Àß¸øµÈ ÇØÁ¦(dangling reference)'¹®Á¦µµ ¹ß»ıÇÒ ¼ö ÀÖ´Ù. ÀÌ·± ¹®Á¦µéÀº
ÇÁ·Î±×·¡¹ÖÀ» º¹ÀâÇÏ°Ô ¸¸µå´Â ¿äÀÎ Áß ÇÏ³ªÀÌ´Ù.

ÀÌ¸¦ ÇØ°áÇÏ±â À§ÇØ µîÀåÇÑ °ÍÀÌ ½º¸¶Æ® Æ÷ÀÎÅÍ·Î, ½º¸¶Æ® Æ÷ÀÎÅÍ´Â Æ÷ÀÎÅÍ°¡ °¡¸®Å°´Â ¸Ş¸ğ¸®¸¦ ÀÚµ¿À¸·Î ÇØÁ¦ÇÏ´Â
¿ªÇÒÀ» ÇÑ´Ù. Áï, ÇÁ·Î±×·¡¸Ó´Â ¸Ş¸ğ¸® °ü¸®¿¡ ´ëÇØ Å©°Ô ½Å°æ ¾µ ÇÊ¿ä°¡ ¾ø´Ù.

ex)
#include <memory>

int main()
{
	std::unique_ptr<int> smart_ptr(new int(10));
	return 0;
}

À§ ¿¹Á¦¿¡¼­ std::unique_ptr<int>´Â int Å¸ÀÔÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍÀÌ´Ù.ÀÌ ½º¸¶Æ® Æ÷ÀÎÅÍ´Â new int(10)À» ÅëÇØ
µ¿ÀûÀ¸·Î ÇÒ´çµÈ ¸Ş¸ğ¸®¸¦ °¡¸®Å°°í ÀÖ´Ù.±×·¯³ª °¡Àå Áß¿äÇÑ Á¡Àº main ÇÔ¼ö°¡ ³¡³ª°í samrt_ptrÀÌ »ç¶óÁú ¶§,
smart_ptrÀÌ °¡¸®Å°´Â ¸Ş¸ğ¸®µµ ÀÚµ¿À¸·Î ÇØÁ¦µÈ´Ù´Â °ÍÀÌ´Ù.ÀÌ·¸°Ô ÇØ¼­ ÇÁ·Î±×·¡¸Ó´Â ¸Ş¸ğ¸® ÇØÁ¦¸¦ ½Å°æ ¾µ
ÇÊ¿ä°¡ ¾ø°Ô µÈ´Ù.

½º¸¶Æ® Æ÷ÀÎÅÍ´Â ÀÌ·¯ÇÑ ¸Ş¸ğ¸® °ü¸® ¿Ü¿¡µµ ¼ÒÀ¯±Ç(ownership) °³³äÀ» µµÀÔÇÏ¿© ÀÚ¿øÀ» ¾ÈÀüÇÏ°Ô °øÀ¯ÇÏ°Å³ª
ÀÌµ¿½ÃÅ°´Â µ¥µµ »ç¿ëµÈ´Ù. << --ÀÌ°Ç ´ÙÀ½¿¡

2. ½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ÇÊ¿ä¼º°ú »ç¿ëÀÌÀ¯

½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ÇÊ¿ä¼º°ú »ç¿ë ÀÌÀ¯¸¦ ÀÌÇØÇÏ·Á¸é ¸ÕÀú C++ÀÇ ¸Ş¸ğ¸® °ü¸® Ã¼°è¿Í ±×¿¡ µû¸¥ ¹®Á¦Á¡À» ÀÌÇØÇØ¾ß
ÇÑ´Ù.C++¿¡¼­´Â µ¿Àû ¸Ş¸ğ¸® ÇÒ´ç°ú ÇØÁ¦¸¦ Á÷Á¢ °ü¸®ÇØ¾ß ÇÑ´Ù.new¸¦ ÅëÇØ µ¿ÀûÀ¸·Î ¸Ş¸ğ¸®¸¦ ÇÒ´çÇÏ¸é ¹İµå½Ã
delete¸¦ ÅëÇØ ±× ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇØ¾ß ÇÑ´Ù.

ex)
int* ptr = new int(10); // ¸Ş¸ğ¸® ÇÒ´ç
delete ptr; // ¸Ş¸ğ¸® ÇØÁ¦

±×·±µ¥ ÀÌ·± ¹æ½Ä¿¡´Â µÎ°¡Áö Å« ¹®Á¦°¡ ÀÖ´Ù.

Ã¹¹øÂ°´Â ¸Ş¸ğ¸® ´©¼öÀÌ´Ù.µ¿ÀûÀ¸·Î ÇÒ´çÇÑ ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÏ±â ¾Ê°í ÀØ¾î¹ö¸®¸é ±× ¸Ş¸ğ¸®´Â °è¼Ó ½Ã½ºÅÛ¿¡ ÇÒ´çµÈ
»óÅÂ·Î ³²°ÔµÈ´Ù.ÀÌ·¸°Ô µÇ¸é ¸Ş¸ğ¸® »ç¿ë·®ÀÌ Áõ°¡ÇÏ°í, °á±¹Àº ½Ã½ºÅ×¸ŞÀÇ ¼º´ÉÀ» ÀúÇÏ½ÃÅ°´Â ¹®Á¦°¡ ¹ß»ıÇÑ´Ù.

µÎ¹øÂ° ¹®Á¦´Â ÇØÁ¦ ÈÄ »ç¿ë(dangling pointer)ÀÌ´Ù.ÀÌ¹Ì ÇØÁ¦µÈ ¸Ş¸ğ¸®¸¦ °è¼Ó »ç¿ëÇÏ·Á´Â °æ¿ì¿¡ ¹ß»ıÇÑ´Ù.ÀÌ´Â
µ¥ÀÌÅÍ ¼Õ½ÇÀÌ³ª ½Ã½ºÅÛ Ãæµ¹À» ÀÏÀ¸Å³ ¼ö ÀÖ´Â ½É°¢ÇÑ ¹®Á¦ÀÌ´Ù.

ex)
int* ptr = new int(10);
delete ptr;
*ptr = 20; // Àß¸øµÈ ÇØÁ¦ ÈÄ »ç¿ë

ÀÌÃ³·³ µ¿Àû ¸Ş¸ğ¸® °ü¸®´Â ÇÁ·Î±×·¡¹ÖÀÇ º¹Àâ¼ºÀ» Áõ°¡½ÃÅ°°í, ½Ç¼ö·Î ÀÎÇÑ ¿À·ù °¡´É¼ºÀ» ³ôÀÎ´Ù.ÀÌ¸¦ ÇØ°áÇÏ±â
À§ÇØ µîÀåÇÑ °ÍÀÌ ¹Ù·Î ½º¸¶Æ® Æ÷ÀÎÅÍÀÌ´Ù.½º¸¶Æ® Æ÷ÀÎÅÍ´Â Æ÷ÀÎÅÍ°¡ °¡¸®Å°´Â ¸Ş¸ğ¸®¸¦ ÀÚµ¿À¸·Î ÇØÁ¦ÇØ ÁÖ±â ¶§¹®¿¡
À§¿Í °°Àº ¹®Á¦¸¦ È¿°úÀûÀ¸·Î ¹æÁö ÇÒ ¼ö ÀÖ´Ù.

ex)
std::unique_ptr<int> smart_ptr(new int(10)); // ¸Ş¸ğ¸® ÇÒ´ç
// ¸Ş¸ğ¸® ÇØÁ¦´Â ÇÊ¿ä ¾øÀ½

½º¸¶Æ® Æ÷ÀÎÅÍ¸¦ »ç¿ëÇÏ¸é ¸Ş¸ğ¸®¸¦ Á÷Á¢ °ü¸®ÇÏ´Â ¼ö°í¸¦ ´ú ¼ö ÀÖ´Ù. ¶ÇÇÑ ¸Ş¸ğ¸® ´©¼ö³ª ÇØÁ¦ ÈÄ »ç¿ë°ú °°Àº ½Ç¼ö¸¦
¿¹¹æ ÇÒ ¼ö ÀÖ´Ù. ÀÌ·¯ÇÑ ÀÌÀ¯·Î, C++¿¡¼­´Â °¡´ÉÇÑ ÇÑ ½º¸¶Æ® Æ÷ÀÎÅÍ¸¦ »ç¿ëÇÏ´Â °ÍÀÌ ±ÇÀå µÈ´Ù.

ÀÌ¿Ü¿¡µµ ½º¸¶Æ® Æ÷ÀÎÅÍ´Â ¸Ş¸ğ¸® ÀÌ¿ÜÀÇ ¸®¼Ò½º¸¦ °ü¸® ÇÏ´Â µ¥¿¡µµ »ç¿ë ÇÒ ¼ö ÀÖ´Ù. ÆÄÀÏ, ³×Æ®¿öÅ© ¿¬°á, ¹ÂÅØ½º
µîÀÇ ¸®¼Ò½º¸¦ ¾ÈÀüÇÏ°Ô °ü¸®ÇÏ±â À§ÇØ ½º¸¶Æ® Æ÷ÀÎÅÍ¸¦ »ç¿ë ÇÒ ¼ö ÀÖ´Ù.

3. ½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ÀÛµ¿ ¿ø¸®

½º¸¶Æ® Æ÷ÀÎÅÍ´Â Æ÷ÀÎÅÍÃ³·³ µ¿ÀÛÇÏÁö¸¸, ¸Ş¸ğ¸®¸¦ Á÷Á¢ °ü¸®ÇÏ´Â °ÍÀÌ ¾Æ´Ï¶ó RAII(resource Acquistion Is
Inintialization) ÀÌ¶ó´Â ¿øÄ¢À» »ç¿ëÇØ ¸Ş¸ğ¸®¸¦ ÀÚµ¿À¸·Î °ü¸®ÇÑ´Ù. RAII´Â °´Ã¼ÀÇ ¼ö¸íÀÌ ±× °´Ã¼°¡ ¼ÒÀ¯ÇÑ
ÀÚ¿øÀÇ ¼ö¸í°ú µ¿ÀÏÇÏ°Ô °ü¸®µÇ´Â °ÍÀ» ÀÇ¹Ì ÇÑ´Ù. Áï, °´Ã¼°¡ »ı¼º µÉ ¶§ ÀÚ¿øÀ» ÇÒ´çÇÏ°í, °´Ã¼°¡ ¼Ò¸ê µÉ ¶§
ÀÚ¿øÀ» ÇØÁ¦ ÇÑ´Ù.

½º¸¶Æ® Æ÷ÀÎÅÍ´Â ±âº»ÀûÀ¸·Î ÅÛÇÃ¸´ Å¬·¡½º·Î, Æ÷ÀÎÅÍ¿Í °°Àº ¹æ½ÄÀ¸·Î »ç¿ë ÇÒ ¼ö ÀÖ´Ù. ±×·¯³ª ½º¸¶Æ® Æ÷ÀÎÅÍ °´Ã¼°¡
¼Ò¸ê µÉ ¶§, ½º¸¶Æ® Æ÷ÀÎÅÍ°¡ °¡¸®Å°´Â ¸Ş¸ğ¸®¸¦ ÀÚµ¿À¸·Î ÇØÁ¦ÇÑ´Ù. ÀÌ·¸°Ô ÇØ¼­ ÇÁ·Î±×·¡¸Ó°¡ ¸Ş¸ğ¸® ÇØÁ¦¸¦
ÀØ¾î ¹ö¸®´Â ¹®Á¦¸¦ ¿¹¹æ ÇÒ ¼ö ÀÖ´Ù.

ex)
std::unique_ptr<int> smart_ptr(new int(10)); // »ç’Û Æ÷ÀÎÅÍ »ı¼º
// ½º¸¶Æ® Æ÷ÀÎÅÍ°¡ ¼Ò¸êµÇ¸é ¸Ş¸ğ¸®´Â ÀÚµ¿À¸·Î ÇØÁ¦µÈ´Ù.

½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ÀÛµ¿ ¿ø¸®¸¦ ÀÌÇØÇÏ±â À§ÇØ¼­´Â C++ÀÇ »ı¼ºÀÚ¿Í ¼Ò¸êÀÚ¿¡ ´ëÇÑ ÀÌÇØ°¡ ÇÊ¿äÇÏ´Ù.»ı¼ºÀÚ´Â °´Ã¼°¡
»ı¼ºµÉ ¶§ È£ÃâµÇ°í, ¼Ò¸êÀÚ´Â °´Ã¼°¡ ¼Ò¸êµÉ ‹š È£ÃâµÈ´Ù.½º¸¶Æ® Æ÷ÀÎÅÍÀÇ °æ¿ì »ı¼ºÀÚ¿¡¼­ ¸Ş¸ğ¸®¸¦ ÇÒ´çÇÏ°í,
¼Ò¸êÀÚ¿¡¼­ ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÑ´Ù.

½º¸¶Æ® Æ÷ÀÎÅÍ´Â ³»ºÎÀûÀ¸·Î '¿ø½Ã Æ÷ÀÎÅÍ(raw pointer)'¸¦ º¸°üÇÏ°í ÀÖ´Ù.ÀÌ ¿ø½Ã Æ÷ÀÎÅÍ´Â ½º¸¶Æ® Æ÷ÀÎÅÍ°¡
°¡¸®Å°´Â ½ÇÁ¦ ¸Ş¸ğ¸®¸¦ °¡¸®Å²´Ù.±×·¯³ª »ç¿ëÀÚ´Â ÀÌ ¿ø½Ã Æ÷ÀÎÅÍ¿¡ Á÷Á¢ Á¢±Ù ÇÒ ¼ö ¾øÀ¸¸ç, ½º¸¶Æ® Æ÷ÀÎÅÍ°¡ Á¦°ø
ÇÏ´Â ÀÎÅÍÆäÀÌ½º¸¦ ÅëÇØ¼­¸¸ ¸Ş¸ğ¸®¿¡ Á¢±Ù ÇÒ ¼ö ÀÖ´Ù.

ex)
std::unique_ptr<int> smart_ptr(new int(10));
*smart_ptr = 20; // ½º¸¶Æ® Æ÷ÀÎÅÍ¸¦ ÅëÇØ ¸Ş¸ğ¸®¿¡ Á¢±Ù

½º¸¶Æ® Æ÷ÀÎÅÍ´Â ¶ÇÇÑ '¼ÒÀ¯±Ç(ownership)' °³³äÀ» µµÀÔÇÏ¿©, µ¿ÀÏÇÑ ¸Ş¸ğ¸®¿¡ ´ëÇÑ Á¢±ÙÀ» °ü¸®ÇÑ´Ù.
¿¹¸¦ µé¾î, std::unique_ptr´Â ÀÌ¸§¿¡¼­µµ ÇÒ ¼ö ÀÖµíÀÌ, ´Ü ÇÏ³ªÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ¸¸ÀÌ ¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ ÇÒ ¼ö ÀÖ´Ù.
ÀÌ´Â ¸Ş¸ğ¸® ÇØÁ¦¸¦ º¸´Ù ¾ÈÀüÇÏ°Ô ¸¸µé¾î ÁØ´Ù.

½º¸¶Æ® Æ÷ÀÎÅÍ´Â ÀÌ·¯ÇÑ ¹æ½ÄÀ¸·Î ¸Ş¸ğ¸® °ü¸®ÀÇ ºÎ´ãÀ» ÁÙ¿©ÁØ´Ù. ÀÌÁ¦ ÀÌÇØ ÇÏ±â ¾î·Á¿ü´ø Æ÷ÀÎÅÍÀÇ °³³äÀ» Á» ´õ
½±°Ô ´Ù·ê ¼ö ÀÖ°Ô µÈ´Ù.

[½º¸¶Æ® Æ÷ÀÎÅÍÀÇ Á¾·ù]

C++ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ´Â ´Ù¾çÇÑ Á¾·ù°¡ ÀÖÀ¸¸ç, °¢°¢ÀÌ ¸Ş¸ğ¸® °ü¸®¸¦ Áö¿øÇÏ´Â µ¶Æ¯ÇÑ ¹æ½ÄÀ» °¡Áö°í ÀÖ´Ù.
ÀÌ¹ø Àå¿¡¼­´Â ³×°¡Áö ÁÖ¿ä ½º¸¶Æ® Æ÷ÀÎÅÍ - std::auto_ptr, std::unique_ptr, std::shared_ptr, std::weak_ptr
À» »ìÆìº¸ÀÚ. ÀÌÁß std::auto_ptrÀº C++11 ÀÌÈÄ·Î deprecated(»ç¿ëÀÌ ±ÇÀåµÇÁö ¾Ê´Â)µÇ¾úÀ¸³ª ÀÌÇØ¸¦ À§ÇØ
Æ÷ÇÔ½ÃÄ×´Ù. ³ª¸ÓÁö ¼¼°¡Áö ½º¸¶Æ®Æ÷ÀÎÅÍ´Â ¸Ş¸ğ¸® ¼ÒÀ¯±ÇÀ» ´Ù·ç´Â ¹æ½ÄÀÌ ¼­·Î ´Ù¸£¹Ç·Î »óÈ²¿¡ ¸Â°Ô ÀûÀıÈ÷ »ç¿ëÇÏ´Â
°ÍÀÌ Áß¿äÇÏ´Ù.

1. std::auto_ptr
std::auto_ptrÀº ÇöÀç C++11ºÎÅÍ deprecated(»ç¿ëÀÌ ±ÇÀåµÇÁö ¾Ê´Â)»óÅÂÀÌ¸ç, ÀÌÈÄ¿¡ ¹è¿ï std::unique_ptrÀÌ ±× 
±â´ÉÀ» ´ëÃ¼ÇÏ°Ô µÈ´Ù. ÇÏÁö¸¸ ¿©ÀüÈ÷ ÀÌÇØ¸¦ µ½±â À§ÇØ std::auto_ptr¿¡ ´ëÇØ °£·«È÷ ¼³¸íÇÏ°íÀÚ ÇÑ´Ù.

std::quto_ptrÀº ÀÌ¸§¿¡¼­µµ ¾Ë ¼ö ÀÖµíÀÌ ÀÚµ¿ Æ÷ÀÎÅÍ¸¦ ÀÇ¹ÌÇÑ´Ù. ÀÌ°ÍÀº ÀÚµ¿ ¸Ş¸ğ¸® °ü¸®¸¦ Áö¿øÇÏ´Â Ã¹ ¹øÂ°
½º¸¶Æ® Æ÷ÀÎÅÍ·Î, ½ºÄÚÇÁ°¡ ³¡³¯ ¶§ ÀÚµ¿À¸·Î ¼Ò¸êÀÚ¸¦ È£ÃâÇÏ¿© ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÑ´Ù.

ex)
#include <memory>

void auto_ptr_exmple()
{
	std::auto_ptr<int> ptr(new int);
	*ptr = 10;
	std::cout << *ptr << std::_Fnv1a_append_value;
} // ¿©±â¼­ ptrÀº ¹üÀ§¸¦ ¹ş¾î³ª Á¦°ÅµÈ´Ù. ¸Ş¸ğ¸®´Â ÀÚµ¿À¸·Î ÇØÁ¦µÈ´Ù.

±×·¯³ª std::auto_ptr¿¡´Â Ä¡¸íÀûÀÎ ¹®Á¦°¡ ÀÖ´Ù. ±×°ÍÀº º¹»ç ¿¬»êÀ» Çã¿ëÇÑ´Ù´Â Á¡À¸·Î, ÀÌ·¯ÇÑ º¹»ç ¿¬»êÀº µ¿ÀÏÇÑ
¸Ş¸ğ¸®¸¦ °¡¸®Å°´Â µÎ °³ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ¸¦ ¸¸µé ¼ö ÀÖÀ½À» ÀÇ¹ÌÇÏ´Âµ¥, ÀÌ´Â µÎ Æ÷ÀÎÅÍ°¡ µ¿ÀÏÇÑ ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÏ·Á°í
ÇÒ ¶§ ¹®Á¦¸¦ ¾ß±â ÇÒ ¼ö ÀÖ´Ù. ÀÌ·¯ÇÑ ÀÌÀ¯·Î std::auto_ptrÀº C++11¿¡¼­ deprecatedµÇ¾úÀ¸¸ç, ´ë½Å
std::unique_ptrÀÌ µµÀÔµÇ¾ú´Ù.

ex)
#include <memory>

void auto_ptr_problem()
{
	std::auto_ptr<int> ptr1(new int);
	*ptr1 = 10;

	std::auto_ptr<int> ptr2 = ptr1; // ptr1ÀÌ ptr2¿¡ º¹»çµÈ´Ù.

	std::cout << *ptr2 << std::endl; // ÀÌ°Ç Á¦´ë·Î µ¿ÀÛÇÑ´Ù.
	std::cout << *ptr1 << std::endl; // Á¤ÀÇµÇÁö ¾Ê´Â µ¿ÀÛ
}

À§ÀÇ ÄÚµå¿¡¼­ º¼ ¼ö ÀÖµíÀÌ, ptr1ÀÌ ptr2·Î º¹»çµÇ¸é¼­ ¹®Á¦°¡ ¹ß»ıÇÑ´Ù. ptr1Àº º¹»çµÈ ÈÄ¿¡ null·Î ¼³Á¤µÇ¸ç,
ptr2°¡ ÀÌÁ¦ µ¿ÀÏÇÑ ¸Ş¸ğ¸®¸¦ °¡¸®Å°°Ô µÈ´Ù. ÀÌ°ÍÀº µÎ°³ÀÇ Æ÷ÀÎÅÍ°¡ µ¿ÀÏÇÑ ¸Ş¸ğ¸®¸¦ °ü¸®ÇÏ°í ÀÖ´Â »óÈ²À» ¸¸µç´Ù.
ÀÌ »óÈ²¿¡¼­ ptr1À» »ç¿ëÇÏ·Á°í ÇÏ¸é ¿¹»óÇÏÁö ¸øÇÑ µ¿ÀÛÀÌ ¹ß»ıÇÏ°Ô µÈ´Ù.

Áï, std::auto_ptrÀº ¼ÒÀ¯±ÇÀ» º¹»çÇÏ´Â ´ë½Å ÀÌÀü ¼ÒÀ¯ÀÚ¿¡¼­ »õ·Î¿î ¼ÒÀ¯ÀÚ·Î ÀÌµ¿ÇÑ´Ù. ÀÌ°ÍÀº ´Ù¸¥ ½º¸¶Æ®
Æ÷ÀÎÅÍ, Æ¯È÷ std::unique_ptr¿¡¼­ º¼ ¼ö ÀÖ´Â º¹»ç ´ë½Å ÀÌµ¿(move)ÀÇ ¾ÆÀÌµğ¾î¸¦ ¹İ¿µÇÏ´Â ÃÊ±âÀÇ ½Ãµµ¿´´Ù.

ÀÌ·¯ÇÑ ¹®Á¦Á¡ ¶§¹®¿¡, std::auto_ptrÀº ´õ ÀÌ»ó »ç¿ëµÇÁö ¾ÊÀ¸¸ç, ´ë½Å std::unique_ptr ¶Ç´Â std::shared_ptr´Â
ÂüÁ¶ Ä«¿îÆÃÀ» ÅëÇØ ¿©·¯°³ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ°¡ µ¿ÀÏÇÑ ÀÚ¿øÀ» ¾ÈÀüÇÏ°Ô °øÀ¯ ÇÒ ¼ö ÀÖµµ·Ï ÇÑ´Ù.

±×·¡µµ std::auto_ptr¿¡ ´ëÇØ ¾Ë¾ÆµÎ¸é ½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ÀÛµ¿ ¿ø¸®¿Í ¹ßÀü °úÁ¤À» ÀÌÇØÇÏ´Âµ¥ µµ¿òÀÌ µÉ ¼ö ÀÖ´Ù. 
ÀÌ°ÍÀÌ C++ÀÇ Ã¹¹øÂ° ½º¸¶Æ® Æ÷ÀÎÅÍ¿´°í, ÈÄ¼Ó ¹öÀü¿¡¼­ °³¼±µÇ°í È®ÀåµÈ °³³äÀ» Á¦°øÇÏ¹Ç·Î, ÀÌ·¯ÇÑ °üÁ¡¿¡¼­
std::auto_ptrÀ» ÀÌÇØÇÏ¸é µµ¿òÀÌ µÈ´Ù. ±×·¯³ª ½ÇÁ¦ ÄÚµå¿¡¼­´Â std::auto_ptr´ë½Å std::unique_ptr³ª
std::shared_ptrÀ» »ç¿ëÇÏµµ·Ï ±ÇÀåÇÑ´Ù.

2. std::unique_ptr

std::unique_ptrÀº ÀÌ¸§¿¡¼­ ¾Ë ¼ö ÀÖµíÀÌ, 'À¯ÀÏÇÑ' Æ÷ÀÎÅÍÀÌ´Ù. Á×, µ¿ÀÏÇÑ ¸Ş¸ğ¸®¸¦ °¡¸®Å°´Â µÎ°³ÀÇ 
std::unique_ptrÀÎ½ºÅÏ½º°¡ µ¿½Ã¿¡ Á¸ÀçÇÒ ¼ö ¾ø´Ù. ÀÌ·¯ÇÑ Æ¯¼ºÀº ¸Ş¸ğ¸® ´©¼ö¿Í °°Àº ÀÏ¹İÀûÀÎ ¹®Á¦¸¦ ¹æÁöÇÏ´Âµ¥
µµÀ½ÀÌ µÈ´Ù.

ex)

std::unique_ptr<int> ptr1(new int(5));
std::unique_ptr<int> ptr2 = ptr1; //ÄÄÆÄÀÏ ¿¡·¯!

À§ÀÇ ÄÚµå¿¡¼­, ptr1À» ptr2·Î º¹»çÇÏ·Á°í Çß´Ù. ÇÏÁö¸¸, ÀÌ°ÍÀº std::unique_ptrÀÇ ÇÙ½É ¿øÄ¢¿¡ À§¹İµÇ¹Ç·Î
ÄÄÆÄÀÏ·¯´Â ÀÌ¸¦ Çã¿ëÇÏÁö ¾Ê´Â´Ù. ±×·¯³ª std::unique_ptrÀº 'ÀÌµ¿' ÀÌ¶ó´Â °³³äÀ» »ç¿ëÇÏ¿© Æ÷ÀÎÅÍÀÇ ¼ÒÀ¯±ÇÀ» ÀÌÀü
ÇÒ ¼ö ÀÖ´Ù. ÀÌ°ÍÀÌ ¾î¶»°Ô ÀÛµ¿ ÇÏ´ÂÁö »ìÆìº¸ÀÚ.

ex)

std::unique_ptr<int> ptr1(new int(5));
std::unique_ptr<int> ptr2 = std::move(ptr1); // ÄÄÆÄÀÏ ok

ÀÌ °æ¿ì, std::move ÇÔ¼ö¸¦ »ç¿ëÇÏ¿© ptr1¿¡¼­ ptr2·Î ¼ÒÀ¯±ÇÀ» 'ÀÌµ¿' ½ÃÄ×´Ù. ÀÌ·Î ÀÎÇØ ptr1Àº ÀÌÁ¦ nullÀÌ µÇ°í,
ptr2´Â ÀÌÀü¿¡ ptr1ÀÌ °¡¸®Ä×´ø ¸Ş¸ğ¸®¸¦ °¡¸®Å°°Ô µÈ´Ù.

ÀÌ·¯ÇÑ Æ¯¼ºÀº std::unique_ptrÀÌ ÀÚ¿øÀÇ 'À¯ÀÏÇÑ' ¼ÒÀ¯ÀÚÀÓÀ» º¸ÀåÇÑ´Ù. ÀÌ°ÍÀº ¸Ş¸ğ¸® °ü¸®¸¦ ´õ¿í ¾ÈÀüÇÏ°í ¿¹Ãø
°¡´ÉÇÏ°Ô ¸¸µå´Â Áß¿äÇÑ ¼Ó¼ºÀÌ´Ù.

std::unique_ptrÀº ÀÌ·¯ÇÑ ¼Ó¼º ´öºĞ¿¡ ´Ù¾çÇÑ À¯½ºÄÉÀÌ½º¿¡¼­ À¯¿ëÇÏ°Ô »ç¿ëµÈ´Ù. ¿¹¸¦ µé¾î, ÇÔ¼ö¿¡¼­ µ¿ÀûÀ¸·Î
ÇÒ´çµÈ ¸Ş¸ğ¸®¸¦ ¹İÈ¯ÇÒ ¶§, std::unique_ptr¸¦ »ç¿ëÇÏ¸é È£ÃâÀÚ°¡ ¹İÈ¯µÈ ¸Ş¸ğ¸®ÀÇ ¼ÒÀ¯±ÇÀ» ¸íÈ®ÇÏ°Ô ÀÌÇØ ÇÒ ¼ö
ÀÖÀ¸¸ç, ¸Ş¸ğ¸®ÀÇ ´©¼öÀÇ À§ÇèÀ» Å©°Ô ÁÙÀÏ ¼ö ÀÖ´Ù.

ex)

std::unique_ptr<int> creatInt(int value)
{
	return std::unique_ptr<int>(new int value));
}

void useInt()
{
	std::unique_ptr<int> ptr = createInt(5);
	// ¿©±â¼­ ptrÀº createInt¿¡¼­ ¹İÈ¯µÈ ¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ÇÑ´Ù.
	// ptrÀÌ ¹üÀ§¸¦ ¹ş¾î³¯ ¶§, ¸Ş¸ğ¸®´Â ÀÚµ¿À¸·Î ÇØÁ¦µÈ´Ù.
}

ÀÌÃ³·³, std::unique_ptrÀº C++¿¡¼­ ¾ÈÀüÇÏ°í È¿°úÀûÀÎ ¸Ş¸ğ¸® °ü¸®¸¦ °¡´ÉÇÏ°Ô ÇÏ´Â °­·ÂÇÑ µµ±¸ÀÌ´Ù.

3. std::shared_ptr

std::shared_ptr´Â ±× ÀÌ¸§¿¡¼­ ¾Ë ¼ö ÀÖµíÀÌ ¸Ş¸ğ¸®¿¡ ´ëÇÑ '°øÀ¯' ¼ÒÀ¯±ÇÀ» Á¦°øÇÏ´Â ½º¸¶Æ® Æ÷ÀÎÅÍÀÌ´Ù.ÀÌ´Â ¿©·¯
std::shared_ptrÀÎ½ºÅÏ½º°¡ µ¿ÀÏÇÑ ¸Ş¸ğ¸®¸¦ °¡¸®Å³ ¼ö ÀÖÀ½À» ÀÇ¹ÌÇÑ´Ù.±×·¸´Ù¸é ¾î¶»°Ô ¸Ş¸ğ¸® ´©¼ö¸¦ ¹æÁöÇÒ±î ?
ÀÌ°ÍÀÌ std::shared_ptrÀÇ ÇÙ½É ÀûÀÎ ºÎºĞÀÌ´Ù.³»ºÎÀûÀ¸·Î ·¹ÆÛ·±½º Ä«¿îÆÃÀ» ¼öÇàÇÏ¿©, ¸Ş¸ğ¸®¸¦ °¡¸®Å°´Â
std::shared_ptr ÀÎ½ºÅÏ½º¸¦ ÃßÀûÇÑ´Ù.

ex)
std::shared_ptr<int ptr1(new int(5));
std::shared_ptr<int> ptr2 = ptr1;

ptr1°ú ptr2 ¸ğµÎ µ¿ÀÏÇÑ ¸Ş¸ğ¸®¸¦ °¡¸®Å°¸ç, ·¹ÆÛ·±½º Ä«¿îÆ®´Â 2ÀÌ´Ù.ÀÌ ¿¹Á¦¿¡¼­ ptr1À» ptr2·Î º¹»çÇß°í, µÑ ´Ù
µ¿ÀÏÇÑ ¸Ş¸ğ¸®¸¦ °¡¸®Å²´Ù.°¢°¢ÀÇ std::shared_ptr´Â ÀÌ ¸Ş¸ğ¸®¿¡ ´ëÇÑ °øÀ¯ ¼ÒÀ¯±ÇÀ» °¡Áö¸ç, ·¹ÆÛ·±½º Ä«¿îÆ®¸¦
ÅëÇØ ÀÌ¸¦ °ü¸®ÇÑ´Ù.ÀÌ °æ¿ì, ·¹ÆÛ·±½º Ä«¿îÆ®´Â 2°¡ µÈ´Ù.

std::shared_ptrÀÇ Áß¿äÇÑ Æ¯Â¡Àº, ·¹ÆÛ·±½º Ä«¿îÆ®°¡ 0ÀÌ µÇ¸é Æ¯½Ã ¸Ş¸ğ¸®°¡ ÇØÁ¦µÈ´Ù´Â Á¡ÀÌ´Ù.ÀÌ´Â ´ÙÀ½°ú °°ÀÌ
µ¿ÀÛÇÑ´Ù.

ex)

{
	std::shared_ptr<int> ptr1(new int(5));
	{
		std::shared_ptr<int> ptr2 = ptr1;
		// ptr1°ú ptr2´Â ¸ğµÎ µ¿ÀÏÇÑ ¸Ş¸ğ¸®¸¦ °¡¸®Å°¸ç, ·¹ÆÛ·±½º Ä«¿îÆ®´Â 2ÀÌ´Ù.
	}	// ptr2°¡ ¹üÀ§¸¦ ¹ş¾î³ª¹Ç·Î, ·¹ÆÛ·±½º Ä«¿îÆ®´Â 1·Î °¨¼ÒÇÑ´Ù.
	// ptr1ÀÌ ¿©ÀüÈ÷ ¸Ş¸ğ¸®¸¦ °¡¸®Å°°í ÀÖÀ¸¹Ç·Î, ¸Ş¸ğ¸®´Â À¯ÁöµÈ´Ù.
}	// ptr1ÀÌ ¹üÀ§¸¦ ¹ş¾î³ª¸é, ·¹ÆÛ·±½º Ä«¿îÆ®°¡ 0ÀÌ µÇ°í ¸Ş¸ğ¸®°¡ ÇØÁ¦µÈ´Ù.

µû¶ó¼­ std::chared_ptrÀº ¿©·¯ °´Ã¼°¡ µ¿ÀÏÇÑ ¸®¼Ò½º¸¦ ¾ÈÀüÇÏ°Ô °øÀ¯ ÇÒ ¼ö ÀÖµµ·Ï ÇØÁØ´Ù.±×·¯³ª ÀÌ°ÍÀº ¹İµå½Ã
ÇÊ¿äÇÑ °æ¿ì¿¡¸¸ »ç¿ëÇØ¾ß ÇÑ´Ù.ºÒÇÊ¿äÇÑ ·¹ÆÛ·±½º Ä«¿îÆÃÀº ¼º´ÉÀ» ÀúÇÏ½ÃÅ²´Ù.¶ÇÇÑ std::shared_ptrÀº ¼øÈ¯ ÂüÁ¶
¹®Á¦¸¦ ¾ß±â ÇÒ ¼ö ÀÖ´Ù.ÀÌ ¹®Á¦´Â std::weak_ptrÀ» ÅëÇØ ÇØ°á ÇÒ ¼ö ÀÖ´Ù.

4. std::weak_ptr

std::weak_ptr´Â std::shared_ptrÀÇ Áß¿äÇÑ µ¿¹İÀÚÀÌ¸ç, ½º¸¶Æ® Æ÷ÀÎÅÍ°¡ ¼øÈ¯ ÂüÁ¶¿Í °°Àº ¹®Á¦¿¡ ´ëÃ³ÇÏ´Â µ¥ Å«
µµ¿òÀ» ÁØ´Ù.±âº»ÀûÀ¸·Î std::weak_ptrÀº std::shared_ptr¿Í À¯»çÇÏÁö¸¸, °¡¸®Å°´Â °´Ã¼ÀÇ ¼ö¸í¿¡ ¿µ·®À» ÁÖÁö
¾Ê´Â '¾àÇÑ' ÂüÁ¶¸¦ Á¦°øÇÑ´Ù´Â Á¡¿¡¼­ ´Ù¸£´Ù.ÀÌ´Â ¼øÈ¯ ÂüÁ¶¸¦ ÇÇÇÏ´Âµ¥ À¯¿ëÇÏ´Ù.

¼øÈ¯ ÂüÁ¶´Â µÎ °´Ã¼°¡ ¼­·Î¸¦ ÂüÁ¶ÇÏ°í, µÑ´Ù std::shared_ptr¸¦ »ç¿ëÇÏ¿© ÂüÁ¶¸¦ À¯ÁöÇÏ´Â °æ¿ì¿¡ ¹ß»ıÇÑ´Ù.ÀÌ
°æ¿ì, µÎ °´Ã¼ ¸ğµÎ ·¹ÆÛ·±½º Ä«¿îÆ®°¡ Àı´ë 0ÀÌ µÇÁö ¾Ê¾Æ ¸Ş¸ğ¸® ´©¼ö°¡ ¹ß»ıÇÑ´Ù.

ex)

struct B;
struct A
{
	std::shared_ptr<B> b_ptr;
};

sruct B
{
	std::shared_ptr<A> a_ptr;
};

std::shared_ptr<A> a(new A());
std::shared_ptr<B> b(new B());

a->b_ptr = b;
b->a_ptr = a; // ¼øÈ¯ ÂüÁ¶ »ı¼º

À§ ¿¹Á¦¿¡¼­, A¿Í B°´Ã¼´Â ¼­·Î¸¦ ÂüÁ¶ÇÏ¹Ç·Î ¼øÈ¯ ÂüÁ¶°¡ ¹ß»ıÇÑ´Ù.·¹ÆÛ·±½º Ä«¿îÆ®°¡ Àı´ë·Î 0ÀÌ µÇÁö ¾ÊÀ¸¹Ç·Î ¸Ş¸ğ¸®°¡
´©¼öµÈ´Ù.ÀÌ ¹®Á¦¸¦ ÇØ°áÇÏ·Á¸é std::weak_ptrÀ» »ç¿ëÇÑ´Ù.

ex)

struct B;
struct A
{
	std::shared_ptr<B> b_ptr;
};

struct B
{
	std::weak_ptr<A> a_ptr; // ¾àÇÑ ÂüÁ¶ »ç¿ë
};

std::shared_ptr<A> a(new A());
std::shared_ptr<A> a(new B());

a->b_ptr = b;
b->a_ptr = a;

*µÎ ¿¹Á¦ÀÇ Â÷ÀÌ´Â strct B¿¡¼­ »ç¿ëµÈ°ÍÀÌ shared_ptrÀÌ³Ä weak_ptrÀÌ³ÄÀÇ Â÷ÀÌ»ÓÀÌ´Ù.a_ptr

ÀÌÁ¦ B´Â std::weak_ptr¸¦ »ç¿ëÇÏ¿© A¸¦ ÇÏ¹Ç·Î, ¼øÈ¯ ÂüÁ¶°¡ ¹ß»ıÇÏÁö ¾Ê´Â´Ù. A°¡ ÆÄ±«µÇ¸é std::weak_ptrÀº lock() ÇÔ¼ö¸¦
»ç¿ëÇÏ¿© std::shared_ptr·Î º¯È¯ ÇÒ ¼ö ÀÖ´Ù. ÀÌ ÇÔ¼ö´Â ÇØ´ç °´Ã¼°¡ ¿©ÀüÈ÷ Á¸ÀçÇÏ´Â °æ¿ì¿¡¸¸ st::shared_ptr¸¦ ¹İÈ¯ÇÏ¹Ç·Î,
¸Ş¸ğ¸®¸¦ ¾ÈÀüÇÏ°Ô Á¢±Ù ÇÒ ¼ö ÀÖ½À´Ï´Ù.

ex)

if (std::shared_ptr<A> a_locked = b->a_ptr.lock())
{
	// °´Ã¼°¡ ¿©ÀüÈ÷ Á¸ÀçÇÏ¹Ç·Î ¾ÈÀüÇÏ°Ô Á¢±Ù ÇÒ ¼ö ÀÖ´Ù.
}

else
{
	// °´Ã¼°¡ ÀÌ¹Ì ÆÄ±«µÇ¾ú´Ù.
}

µû¶ó¼­ std::weak_ptrÀº ¼øÈ¯ ÂüÁ¶¿Í °°Àº º¹ÀâÇÑ ¹®Á¦¸¦ ÇØ°áÇÏ´Âµ¥ ÀÖ¾î¼­ std::shated_ptr¿Í ÇÔ²² Áß¿äÇÑ ¿ªÇÒÀ» ÇÑ´Ù.

[std::unique_ptr¿¡ ´ëÇØ]

std::unique_ptr´Â C++11ºÎÅÍ Á¦°øµÇ´Â ½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ÇÑ Á¾·ùÀÌ´Ù. ÀÌ ½º¸¶Æ® Æ÷ÀÎÅÍ´Â ´ÜÀÌ ¼ÒÀ¯±Ç ¸ğµ¨À» ±¸ÇöÇÑ´Ù. Áï,
std::unique_ptr´Â ¸Ş¸ğ¸® ºí·ÏÀ» µ¶Á¡ÀûÀ¸·Î ¼ÒÀ¯ÇÏ°í, º¹»ç´Â Çã¿ëµÇÁö ¾Ê´Â´Ù. ÀÌ·¯ÇÑ Æ¯¼ºÀº ¸Ş¸ğ¸® ´©¼ö¸¦ ¿¹¹æÇÏ°í, ÀÚ¿øÀ»
¾ÈÀüÇÏ°Ô °ü¸®ÇÏ´Â µ¥ ¸Å¿ì À¯¿ëÇÏ´Ù. ¶ÇÇÑ std::unique_ptr¸¦ »ç¿ëÇÏ´Â °ÍÀÌ ÁÁ´Ù.

1. std::unique_ptrÀÇ Á¤ÀÇ¿Í Æ¯Â¡
std::unique_ptr´Â C++11¿¡¼­ µµÀÔµÈ ½º¸¶Æ®Æ÷ÀÎÅÍ Áß ÇÏ³ª·Î, ÀÌ Æ÷ÀÎÅÍ´Â "À¯ÀÏÇÑ ¼ÒÀ¯±Ç" ¸ğµ¨À» µû¸¥´Ù. ÀÌ¸»Àº, ÇÑ¹ø¿¡ ÇÑ
std::unique_ptr¸¸ÀÌ Æ¯Á¤ °´Ã¼¸¦ ¼ÒÀ¯ ÇÒ ¼ö ÀÖ´Ù´Â ¶æÀÌ´Ù. ÀÌ·¯ÇÑ ¼Ó¼­Àº ´ÜÀÏ ¼ÒÀ¯°¡ º¸ÀåµÇ¾î¾ß ÇÏ´Â ½Ã½ºÅÛ ¸®¼Ò½º °ü¸®¿¡
ÀûÇÕÇÏ´Ù.

ex)

#include <memory>
#include <iostream>

class MyClass
{
public:
	MyClass() { std::cout << "MyCLass constructed\n"; }
	~MyClass() { std::cout << "MyClass destroyed\n"; }
};

int main()
{
	std::unique_ptr<MyClass> ptr1(new MyClass);
}

À§ ¿¹Á¦ ÄÚµå¿¡¼­ std::unique_ptrÀº MyClassÀÎ½ºÅÏ½º¸¦ ¼ÒÀ¯ÇÑ´Ù.ÇÁ·Î±×·¥ÀÌ mainÇÔ¼öÀÇ ¹üÀ§¸¦ ¹ş¾î³ª¸é, std::unique_ptr´Â
ÀÚµ¿À¸·Î ¼ÒÀ¯ÇÑ °´Ã¼¸¦ »èÁ¦ÇÑ´Ù.ÀÌ ‹š¹®¿¡ ¸í½ÃÀûÀ¸·Î delete¸¦ È£ÃâÇÒ ÇÊ¿ä°¡ ¾ø´Ù.

Æ¯È÷ Áß¿äÇÑ Á¡Àº std::uniaue_ptrÀº º¹»ç¸¦ Çã¿ëÇÏÁö ¾Ê´Â´Ù´Â °ÍÀÌ´Ù.Áï, ´Ù¸¥ std::unique_ptr·Î ºÎÅÍ ¼ÒÀ¯±ÇÀ» °¡Á® ¿Ã ¼ö
¾ø´Ù.´ë½Å, std::moveÇÔ¼ö¸¦ »ç¿ëÇØ ¼ÒÀ¯±ÇÀ» ÀÌÀü(transfer) ÇÒ ¼ö ÀÖ´Ù.

ex)

std::Unique_ptr<MyClass> ptr2 = std::move(ptr1);

À§ ÄÚµå´Â ptr1ÀÌ °¡Áö°í ÀÖ´ø ¼ÒÀ¯±ÇÀ» ptr2¿¡°Ô ÀÌÀüÇÑ´Ù. ÀÌÁ¦ ptr1Àº ´õÀÌ»ó °´Ã¼¸¦ ¼ÒÀ¯ÇÏÁö ¾Ê°í, ptr2´Â °´Ã¼ÀÇ »õ·Î¿î
¼ÒÀ¯ÀÚ°¡ µÈ´Ù. ÀÌ·¸°Ô std::unique_ptrÀº ·±Å¸ÀÓ¿¡¼­ ¾ÈÀüÇÏ°Ô °´Ã¼ÀÇ ¼ÒÀ¯±ÇÀ» ÀÌÀüÇÏ´Â °ÍÀ» °¡´ÉÄÉ ÇÑ´Ù.

ÇÑÆí, std::unique_ptrÀº ¼º´É ºñ¿ëÀÌ °ÅÀÇ ¾ø´Ù. ÀÌ´Â std::unique_ptrÀÌ ³»ºÎÀûÀ¸·Î ÀÏ¹İ Æ÷ÀÎÅÍ¸¦ »ç¿ëÇØ °´Ã¼¸¦ ÃßÀûÇÏ±â
¶§¹®ÀÌ´Ù. µû¶ó¼­, std::unique_ptrÀº ¾ÈÀüÇÑ ¸®¼Ò½º °ü¸®¿Í È¿À²¼ºÀ» µ¿½Ã¿¡ ´Ş¼ºÇÏ´Â µ¥ µµÀ½ÀÌ µÈ´Ù.

2. std::unique_ptrÀÇ ±âº» »ç¿ë¹ı
 std::unique_ptrÀ» »ç¿ëÇÏ´Â °ÍÀº ¸Å¿ì °£´ÜÇÏ´Ù. ´ÙÀ½Àº std::unique_ptrÀÇ ±âº» »ç¿ë ¹æ¹ı¿¡ ´ëÇÑ ¸î°¡Áö ¿¹¸¦ º¸¿©ÁÖ´Â C++
ÄÚµåÀÌ´Ù.

ex)

#include <memory>
#include <iostream>

class MyClass
{
public:
	MyClass(int value) : value_(value) { }
	void PrintValue() { std::cout << "Value: " << value_ << "\n"; }
private:
	int value_;
};

int main()
{
	std::unique_ptr<MyClass> ptr1(new MyClass(5));
	ptr1->PrintValue();

	std::unique_ptr<MyClass>ptr2 = std::make_unique<MyClass>(10);
	ptr2->PrintValue();

	// std:: unique_ptr<MyClass> ptr3 = ptr2; // ÀÌ°Ç ÄÄÆÄÀÏ ¿¡·¯¸¦ ¸¸µç´Ù.
	std::unique_ptr<MyClass>ptr3 = std::move(ptr2); // ptr2ÀÇ ¼ÒÀ¯±ÇÀÌ ptr3·Î ¿Å°ÜÁø´Ù.
	ptr3->PrintValue();

	return 0;
}

Ã¹ ¹øÂ° ¿¹Á¦¿¡¼­´Â std::unique_ptr°¡ µ¿ÀûÀ¸·Î ÇÒ´çµÈ MyClass°´Ã¼¸¦ ¼ÒÀ¯ÇÑ´Ù.ÀÌ ¶§¹®¿¡ ¸í½ÃÀûÀ¸·Î delete¸¦ È£ÃâÇÒ ÇÊ¿ä°¡
¾ø´Ù.std::unique_ptr°¡ ¹üÀ§¸¦ ¹ş¾î³ª¸é ÀÚµ¿À¸·Î ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÑ´Ù.

µÎ¹øÂ° ¿¹Á¦¿¡¼­´Â std::make_unique ÇÔ¼ö¸¦ »ç¿ëÇÏ¿© std::unique_ptr¸¦ »ı¼ºÇÕ´Ï´Ù.ÀÌ ¹æ¹ıÀÌ ÁÁÀº ÀÌÀ¯´Â, ÀÌ ÇÔ¼ö´Â °´Ã¼
»ı¼º°ú ¸Ş¸ğ¸® ÇÒ´çÀ» ÇÏ³ªÀÇ ¿¬»êÀ¸·Î °áÇÕÇÏ¹Ç·Î, ¿¹¿Ü ¾ÈÁ¤¼ºÀ» ³ôÀÏ ¼ö ÀÖ±â ¶§¹®ÀÌ´Ù.

¼¼¹ø¤Š ¿¹Á¦¿¡¼­´Â ¼ÒÀ¯±Ç ÀÌÀüÀ» ½Ã¿¬ÇÏ°í ÀÖ´Ù.std::unique_ptr´Â º¹»ç°¡ Çã¿ëµÇÁö ¾ÊÁö¸¸, std::move¸¦ »ç¿ëÇÏ¿© ¼ÒÀ¯±ÇÀ»
´Ù¸¥ std::unique_ptr·Î ÀÌÀü ÇÒ ¼ö ÀÖ´Ù.

¸¶Áö¸·À¸·Î std::unique_ptr´Â °´Ã¼ÀÇ ¸â¹ö ÇÔ¼ö¿¡ Àû±ÙÇÏ±â À§ÇØ ÀÏ¹İ Æ÷ÀÎÅÍÃ³·³->¿¬»êÀÚ¸¦ »ç¿ë ÇÒ ¼ö ÀÖ´Ù.

std::unique_ptrÀº C++ÀÇ Áß¿äÇÑ Æ¯Â¡ÀÎ RAII(Resource Acquisition Is Initialization)ÆĞÅÏÀÇ ÀÏºÎ·Î, µ¿Àû ¸Ş¸ğ¸®¸¦ ¾ÈÀüÇÏ°Ô
°ü¸®ÇÏ´Âµ¥ µµ¿òÀÌ µÈ´Ù.

3. std::unique_ptr¿Í ¼ÒÀ¯±Ç

std::unique_ptrÀÇ ÇÙ½ÉÀûÀÎ Æ¯Â¡ Áß ÇÏ³ª´Â ¼ÒÀ¯±Ç(ownership) °³³äÀÌ´Ù.std::unique_ptrÀº ¼ÒÀ¯ÇÏ°í ÀÖ´Â µ¿Àû ¸Ş¸ğ¸®¿¡ ´ëÇÑ
µ¶Á¢ÀûÀÎ ¼ÒÀ¯±ÇÀ» °¡Áö°í ÀÖ´Ù.ÀÌ´Â ´Ù¸¥ std::unique_ptr °´Ã¼°¡ °°Àº ¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ÇÏµµ·Ï Çã¿ëÇÏÁö ¾Ê´Â´Ù´Â °ÍÀ» ÀÇ¹ÌÇÑ´Ù.

ex)
std::unique_ptr<int> ptr1(new int(5)) // ptr1Àº ÀÌÁ¦ ¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ÇÑ´Ù.
std::unique_ptr<int> ptr2 = ptr1; // ÄÄÆÄÀÏ ¿¡·¯! unipue_ptrÀ» Ä«ÇÇ ÇÒ ¼ö ¾ø´Ù.

ÀÌ°ÍÀº std::unique_ptrÀÌ º¹»ç »ı¼ºÀÚ¿Í º¹»ç ´ëÀÔ ¿¬»êÀÚ¸¦ »èÁ¦(Áï, »ç¿ë ºÒ°¡ ÇÏ°Ô ¸¸µë)ÇÏ±â ‹š¹®ÀÌ´Ù.
ÀÌ·Î ÀÎÇØ std::unique_ptrÀÇ º¹»ç°¡ ¸·È÷¹Ç·Î, ÇÏ³ªÀÇ std::unique_ptr¸¸ÀÌ Æ¯Á¤ ¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ ÇÒ ¼ö ÀÖ´Ù.

ÇÏÁö¸¸, std::unique_ptrÀº ¼ÒÀ¯±ÇÀ» ´Ù¸¥ std::unique_ptr·Î ÀÌÀü(transfer)½ÃÅ°´Â °ÍÀº °¡´ÉÇÏ´Ù.ÀÌ´Â std::move¸¦
ÅëÇØ ¼öÇàµÈ´Ù.

ex)
std::unique_ptr<int> ptr1(new int(5));
std::unique_ptr<int> ptr2 = std::move(ptr1);

À§ ¿¹Á¦¿¡¼­ std::move¸¦ »ç¿ëÇÏ¸é ptr1Àº ¼ÒÀ¯±ÇÀ» ptr2·Î ÀÌÀü½ÃÅ°°í, ÀÌÁ¦ ´õÀÌ»ó ¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ÇÏ°í ÀÖÁö ¾Ê´Ù. ptr2°¡ ÀÌÁ¦ ±×
¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ÇÏ°í ÀÖÀ¸¹Ç·Î, ptr2°¡ ¹üÀ§¸¦ ¹ş¾î³ª¸é ÇØ´ç ¸Ş¸ğ¸®´Â ÀÚµ¿À¸·Î ÇØÁ¦µÈ´Ù.

ÀÌ·¯ÇÑ ¼ÒÀ¯±Ç ÀÌÀü Æ¯¼ºÀ¸·Î ÀÎÇØ std::unique_ptrÀº ÀÚ¿øÀÇ ¼ÒÀ¯¿Í »ı¸íÁÖ±â¸¦ ¸íÈ®ÇÏ°Ô °ü¸®ÇÒ ¼ö ÀÖÀ¸¸ç, ¸Ş¸ğ¸® ´©¼ö¸¦
¹æÁöÇÏ´Âµ¥ µµ¿òÀÌ µÈ´Ù. ÀÌ·¯ÇÑ ¼Û±Ç ¸ğµ¨Àº C++ÀÇ ÀÚ¿ø °ü¸® Àü·«ÀÎ RAII¿Í Àß ¾î¿ï¸°´Ù.

4. std::unique_ptrÀÇ ¿¹Á¦ÄÚµå¿Í È°¿ë¹ı

std::unique_ptr¸¦ ÀÌÇØÇÏ´Âµ¥ ÇÊ¿äÇÑ ÇÙ½É °³³ä°ú ±âº»ÀûÀÎ »ç¿ë¹ı¿¡ ´ëÇØ ¾Ë¾Æº¸ÀÚ. std::unique_ptrÀº µ¶Á¡Àû ¼ÒÀ¯±ÇÀ»
°¡Áö´Â ½º¸¶Æ® Æ÷ÀÎÅÍ ÀÌ¸ç, ÀÌ´Â ÇÏ³ªÀÇ std::unique_ptr¸¸ÀÌ Æ¯Á¤ ¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ ÇÒ ¼ö ÀÖÀ½À» ÀÇ¹ÌÇÏ¸ç, ÀÌ ¼ÒÀ¯±ÇÀ» ´Ù¸¥
std::unique_ptr·Î ÀÌÀü(¶Ç´Â ÀÌµ¿)½ÃÅ³ ¼ö ÀÖ´Ù.

ÀÌ·¯ÇÑ ¼Ó¼ºÀº std::unique_ptr°¡ Æ¯È÷ ÇÒ´çµÈ ¸Ş¸ğ¸®¸¦ °ü¸®ÇÏ´Âµ¥ À¯¿ëÇÏ´Ù. ÀÌ°ÍÀº C++¿¡¼­ ÀÚÁÖ ¹ß»ıÇÏ´Â ¹®Á¦ Áß ÇÏ³ªÀÎ ¸Ş¸ğ¸®
´©¼ö¸¦ ¹æÁöÇÏ°í ÀÚ¿øÀ» È¿À²ÀûÀ¸·Î °ü¸®ÇÏ´Â µ¥ µµ¿òÀÌ µÈ´Ù.

ÀÌÁ¦ std::unique_ptrÀÇ È°¿ë¹ıÀ» »ìÆìº¸ÀÚ.

ex) ±âº» »ç¿ë¹ı)
#include <memory>

int main()
{
	std::unique_ptr<int> ptr(new int(5)); // µ¿ÀûÀ¸·Î int¸¦ ÇÒ´çÇÏ°í, ptrÀÌ ±×°ÍÀ» ¼ÒÀ¯ÇÏ°Ô ÇÔ
	// ÀÌÁ¦ ptrÀº µ¿ÀûÀ¸·Î ÇÒ´çµÈ int¸¦ °¡¸®Å²´Ù.
	// ptrÀÌ ¹üÀ§¸¦ ¹ş¾î³ª¸é ÀÚµ¿À¸·Î ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÑ´Ù.
}

ex) ¼ÒÀ¯±Ç ÀÌÀü)
#include<memory>

int main()
{
	std::unique_ptr<int> ptr1(new int(5)); // µ¿ÀûÀ¸·Î int¸¦ ÇÒ´çÇÏ°í, ptr1ÀÌ ±×°ÍÀ» ¼ÒÀ¯ÇÏ°Ô ÇÔ
	std::unique_ptr<int> ptr2;	// ¾ÆÁ÷ ¾Æ¹«°Íµµ ¼ÒÀ¯ÇÏÁö ¾ÊÀ½

	ptr2 = std::move(ptr1); // ptr1ÀÇ ¼ÒÀ¯±ÇÀ» ptr2·Î ÀÌÀü
	// ÀÌÁ¦ ptr2´Â µ¿ÀûÀ¸·Î ÇÒ´çµÈ int¸¦ ¼ÒÀ¯ÇÏ°í, ptr1Àº ¾Æ¹«°Íµµ ¼ÒÀ¯ÇÏ°í ÀÖÁö ¾Ê´Ù.
	// ptr2°¡ ¹üÀ§¸¦ ¹ş¾î³ª¸é ÀÚµ¿À¸·Î ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÑ´Ù.
}

ÀÌ ¿¹Á¦¿¡¼­´Â std::unique_ptrÀÇ ¼ÒÀ¯±ÇÀ» ÀÌÀüÇÏ´Â ¹æ¹ıÀ» º¸¿©ÁØ´Ù. std::move¸¦ »ç¿ëÇÏ¿© ptr1ÀÇ ¼ÒÀ¯±ÇÀ» ptr2·Î ÀÌÀüÇÏ°í ÀÖ´Ù. ÀÌÁ¦
ptr2°¡ ¸Ş¸ğ¸®¸¦ ¼ÒÀ¯ÇÏ°í ÀÖÀ¸¹Ç·Î, ptr2°¡ ¹üÀ§¸¦ ¹ş¾î³ª¸é ÇØ´ç ¸Ş¸ğ¸®´Â ÀÚµ¿À¸·Î ÇØÁ¦µÈ´Ù.

¶ÇÇÑ std::unique_ptr´Â Ä¿½ºÅÒ deleters¸¦ Áö¿øÇÑ´Ù. ÀÌ´Â std::unique_ptr°¡ ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÏ´Â ¹æ¹ıÀ» »ç¿ëÇÏÀÚ°¡ Á¤ÀÇ ÇÒ ¼ö ÀÖÀ½À» ÀÇ¹ÌÇÑ´Ù.
¿¹¸¦ µé¾î, ÆÄÀÏ ÇÚµéÀÌ³ª ³×Æ®¿öÅ© ¼ÒÄÏ°ú °°Àº °Íµé.

ex) Ä¿½ºÅÒ delete

#include<memory>
#include<cstdio>

struct FileDeleter
{
	void operator()(std::FILE* file) const
	{
		if (file)
		{
			std::fclose(file);
		}
	}
};

int main()
{
	std::unique_ptr<std::FILE, FileDeleter> filePtr(std::fopen("myfile.txt", "r"));
	// ÀÌÁ¦ filePtrÀº myfile.txt¸¦ °¡¸®Å°´Â ÆÄÀÏ ÇÚµéÀ» ¼ÒÀ¯ÇÑ´Ù.
	// filePtrÀÌ ¹üÀ§¸¦ ¹ş¾î³ª¸é ½º½º·Î Ä¿½ºÅÒ deleter°¡ È£­ŒµÇ¾î ÆÄÀÏÀÌ ÀÚµ¿À¸·Î ´İÈù´Ù.
}
 
ÀÌÃ³·³ std::unique_ptrÀº ÀÚ¿øÀ» È¿À²ÀûÀ¸·Î °ü¸®ÇÏ´Â µ¥ ¸Å¿ì À¯¿ëÇÑ µµ±¸ÀÌ´Ù. C++ ÇÁ·Î±×·¡¹Ö¿¡¼­ ÀÚ¿ø°ü¸®´Â Áß¿äÇÑ ÁÖÁ¦ÀÌ¸ç
std::unique_ptr´Â ÀÌ ¹®Á¦¸¦ ÇØ°áÇÏ´Â µ¥ µµ¿òÀÌ µÈ´Ù.

5. std::unique_ptr ¿¹¿Ü Ã³¸®

C++¿¡¼­´Â ¿¹¿Ü Ã³¸®°¡ Áß¿äÇÑ ºÎºĞÀ» Â÷ÁöÇÑ´Ù. ±× Áß std::uniqur_ptr¿Í ¿¹¿Ü Ã³¸®¸¦ ÇÔ²¾ ´Ù·ç´Â ¹æ¹ı¿¡ ´ëÇØ ÀÌ¾ß±â ÇØº¸ÀÚ. std::unique_ptr
´Â ¼ÒÀ¯ÇÏ°í ÀÖ´Â ¸Ş¸ğ¸®¸¦ ÀÚµ¿À¸·Î ÇØÁ¦ÇÏ´Â Æ¯¼º ¶§¹®¿¡, ÀÌ´Â ¿¹¿Ü°¡ ¹ß»ıÇßÀ» ¶§ ¸Ş¸ğ¸® ´©¼ö¸¦ ¹æÁöÇÏ´Âµ¥ Å« µµ¿òÀÌ µÈ´Ù.

ex)

#include <iostream>
#include <memory>

void MyFunction()
{
	std::unique_ptr<int> ptr(new int(5)); // µ¿ÀûÀ¸·Î int¸¦ ÇÒ´çÇÏ°í, ptrÀÌ ±×°ÍÀ» ¼ÒÀ¯ÇÏ°Ô ÇÔ

	// ¿©±â¼­ ¿¹¿Ü°¡ ¹ß»ıÇÑ´Ù°í °¡Á¤ÇÏÀÚ.
	throw std::runtime_error("An error occurred!");

	// ptrÀº ½ºÄÚÇÁ¸¦ ¹ş¾î³ª´Â ¼ø°£ ¸Ş¸ğ¸®¸¦ ÀÚµ¿À¸·Î ÇØÁ¦ÇÑ´Ù.
	// ¿¹¿Ü°¡ ¹ß»ıÇÏ´õ¶óµµ, ¸Ş¸ğ¸® ´©¼ö´Â ¹ß»ıÇÏÁö ¾Ê´Â´Ù.
}

int main()
{
	try
	{
		MyFunction();
	}

	catch (const std::exception& e)
	{
		std::cout << "Caught exception: " << e.what() << "\n";
	}
}

ÀÌ ¿¹Á¦¿¡¼­, MyFunction ÇÔ¼ö ¾È¿¡¼­ std::unique_ptr°¡ »ı¼ºµÇ¾ú´Ù. ÀÌ std::unique_ptr´Â µ¿ÀûÀ¸·Î ÇÒ´çµÈ int¸¦ ¼ÒÀ¯ÇÏ°í ÀÖ´Ù. ±×¸®°í 
ÇÔ¼ö¾È¿¡¼­ ¿¹¿Ü°¡ ¹ß»ıÇÏ¸é, std::unique_ptrÀº ÀÚµ¿À¸·Î ¼ÒÀ¯ÇÏ°í ÀÖ´Â ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÑ´Ù. ÀÌ ‹š¹®¿¡ ¿¹¿Ü°¡ ¹ß»ıÇÏ´õ¶óµµ ¸Ş¸ğ¸® ´©¼ö´Â
¹ß»ıÇÏÁö ¾Ê´Â´Ù.

±×·±µ¥ ¿©±â¼­ ÁÖÀÇÇÒ Á¡ÀÌ ÀÖ´Ù. std::unique_ptr¸¦ ´Ù¸¥ ÇÔ¼ö¿¡ Àü´ŞÇÏ°Å³ª, ÇÔ¼ö¿¡¼­ ¹İÈ¯¹ŞÀ» ¶§´Â ¼ÒÀ¯±Ç ÀÌÀü¿¡ ´ëÇÑ ÀÌÇØ°¡ ÇÊ¿äÇÏ´Ù.
std::unique_ptrÀÇ º¹»ç »ı¼ºÀÚ¿Í º¹ÀÚ ´ëÀÔ ¿¬»êÀÚ´Â »èÁ¦µÇ¾î ÀÖÀ¸¹Ç·Î, std::unique_ptr¸¦ Á÷Á¢ º¹»çÇÏ´Â °ÍÀº ºÒ°¡´ÉÇÏ´Ù. ´ë½Å std::move¸¦
»ç¿ëÇÏ¿© std::unique_ptrÀÇ ¼ÒÀ¯±ÇÀ» ÀÌÀüÇØ¾ß ÇÑ´Ù.

´ÙÀ½Àº std::unique_ptr¸¦ ÇÔ¼ö¿¡ Àü´ŞÇÏ°í ¹İÈ¯ÇÏ´Â ¹æ¹ı¿¡ ´ëÇÑ ¿¹Á¦ÀÌ´Ù.

ex)

#include <memory>

std::unique_ptr<int> CreateUniquePtr()
{
	// std::Unique_ptr¸¦ Á÷Á¢ ÀÜÈ¯ÇÏ¸é, ¼ÒÀ¯±ÇÀÌ ÀÌÀüµÈ´Ù.
	// ÀÌ ¶§¹®¿¡ ÇÔ¼ö°¡ ³¡³­ ÈÄ¿¡µµ ¸Ş¸ğ¸® ´©¼ö´Â ¹ß»ıÇÏÁö ¾Ê´Â´Ù.
	return std::unique_ptr<int>(new int(5));
}

void UseUniquePtr(std::unique_ptr<int> ptr)
{
	// ÇÔ¼ö°¡ Àü´ŞµÈ std::unique_ptr´Â ÀÌ ÇÔ¼ö ¾È¿¡¼­¸¸ À¯È¿ÇÏ´Ù.
	// ÇÔ¼ö°¡ ³¡³­ ÈÄ¿¡´Â ÀÚµ¿À¸·Î ¸Ş¸ğ¸®°¡ ÇØÁ¦µÈ´Ù.
}

int main()
{
	std::unique_ptr<int> ptr = CreateUniquePtr();
	UseUniquePtr(std::move(ptr));	// std::unique_ptr¸¦ ÇÔ¼ö¿¡ Àü´Ş ÇÒ ¶§´Â std::move¸¦ »ç¿ëÇØ¾ß ÇÑ´Ù.

	// ÀÌÁ¦ ptr´Â nullptrÀÌ´Ù. ¼ÒÀ¯±ÇÀÌ UseUniquePtr  ÇÔ¼ö¿¡ ÀÌÀüµÇ¾ú±â ¶§¹®ÀÌ´Ù.
}

ÀÌ ¿¹Á¦¿¡¼­´Â CreateUniquePtrÇÔ¼ö°¡ std::unique_ptr¸¦ ¹İÈ¯ÇÏ°í, UseUniquePtr ÇÔ¼ö°¡ std::unique_ptr¸¦ ¸Å°³ º¯¼ö·Î ¹Ş´Â´Ù. ÀÌ µÎ °æ¿ì
¸ğµÎ, std::unique_ptr¸¦ ÇÔ¼ö¿¡ Àü´Ş ÇÒ ¶§´Â std::move¸¦ »ç¿ëÇß´Ù.

ÀÌÃ³·³ std::unique_ptr´Â ¿¹¿Ü Ã³¸®¿Í ÇÔ²² »ç¿ë µÉ ‹š Æ¯È÷ À¯¿ëÇÏ´Ù. ¸Ş¸ğ¸® ´©¼ö¸¦ ÀåºñÇÏ°í, ÄÚµåÀÇ ¾ÈÀü¼ºÀ» Çâ»ó ÇÒ ¼ö ÀÖ´Ù.

[std::shared_ptr¿¡ ´ëÇØ]

std::shared_ptr´Â C++ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ Áß ÇÏ³ª·Î, ¿©·¯ °÷¿¡¼­ µ¿½Ã¿¡ ¼ÒÀ¯ÇÒ ¼ö ÀÖ´Â ¸Ş¸ğ¸®¸¦ °¡¸®Å°´Â Æ÷ÀÎÅÍÀÌ´Ù.ÀÌ Æ÷ÀÎÅÍ°¡ °¡¸®Å°´Â
¸Ş¸ğ¸®´Â ÂüÁ¶ È½¼ö¸¦ ¼¼¾î, ¸¶Áö¸· std::shared_ptrÀÌ ¼Ò¸êÇÒ ¶§ ÇØÁ¦µÈ´Ù.¸Ş¸ğ¸® ÇØÁ¦¸¦ ÀÚµ¿À¸·Î Ã³¸®ÇÏ¹Ç·Î, °³¹ßÀÚ°¡ Á÷Á¢ ¸Ş¸ğ¸®¸¦
°ü¸®ÇÏ´Âµ¥ µå´Â ½Ã°£°ú ³ë·ÂÀ» ÁÙÀÏ ¼ö ÀÖ´Ù.ÀÌ·Î ÀÎÇØ ÄÚµåÀÇ ¾ÈÁ¤¼ºÀÌ Çâ»óµÇ¸ç, ¸Ş¸ğ¸® ´©¼öÀÇ °¡´É¼ºÀ» ÁÙÀÏ ¼ö ÀÖ´Ù.

1. std::shared_ptrÀÇ Á¤ÀÇ¿Í Æ¯Â¡

std::shared_ptrÀº C++Ç¥ÁØ ¶óÀÌºê·¯¸®ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ Áß ÇÏ³ª·Î¼­, ÂüÁ¶ Ä«¿îÆÃ(reference counting)¹æ½ÄÀ» »ç¿ëÇÏ¿© µ¿Àû ¸Ş¸ğ¸®¸¦ °ü¸®ÇÑ´Ù.
±× ÀÌ¸§¿¡¼­ ¾Ë ¼ö ÀÖµíÀÌ, std::shared_ptrÀº ¿©·¯°³ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ°¡ °°Àº °´Ã¼¸¦ '°øÀ¯' ÇÒ ¼ö ÀÖ°Ô ÇØÁÖ´Â °ÍÀÌ ÁÖ¿ä Æ¯Â¡ÀÌ´Ù.

ÀÌ ½º¸¶Æ® Æ÷ÀÎÅÍ´Â ³»ºÎÀûÀ¸·Î µÎ °¡Áö ÁÖ¿ä ±¸¼º ¿ä¼Ò¸¦ °¡Áö°í ÀÖ´Ù. ÇÏ³ª´Â °¡¸®Å°´Â ½ÇÁ¦ °´Ã¼ ´ëÇÑ Æ÷ÀÎÅÍÀÌ°í, ¶Ç ´Ù¸¥ ÇÏ³ª´Â 'Á¦¾î ºí·Ï'
ÀÌ¶ó°í ºÒ¸®¿ì´Â, ÂüÁ¶ Ä«¿îÅÍ¿Í °ü·ÃµÈ Á¤º¸¸¦ À¯ÁöÇÏ´Â ºÎºĞÀÌ´Ù.

std::shared_ptrÀÌ º¹»çµÇ°Å³ª ´Ù¸¥ °´Ã¼·Î ÀÌµ¿ µÉ ¶§, ÀÌ ÂüÁ¶ Ä«¿îÅÍ°¡ ¾÷µ¥ÀÌÆ®µÇ¸ç, ÂüÁ¶ Ä«¿îÅÍ°¡ 0ÀÌ µÉ ‹š ½ÇÁ¦ °´Ã¼°¡ »èÁ¦µÈ´Ù.

ex)

#include <iostream>
#include <memory>

struct Foo
{
	Foo() { std::cout << "Foo::Foo\n"; }
	~Foo() { std::cout << "Foo::~Foo\n"; }
	void bar() { std::cout << "Foo::bar\n" }
};

int main()
{
	std::shared_ptr<Foo> ptr1 = std::make_shared<Foo>();
	std::cout << "ptr (use count" << ptr1.use_count() << ") at " << ptr1.get() << '\n';
	
	{
		std::shared_ptr<Foo> ptr2 = ptr1;
		f(ptr2);
	}
	
	// ¿©±â¼­ ptr2ÀÇ ¼Ò¸êÀÚ°¡ È£ÃâµÇÁö¸¸, ÂüÁ¶ Ä«¿îÅÍ°¡ 1ÀÌ¹Ç·Î ¾ÆÁ÷ Foo °´Ã¼´Â »èÁ¦µÇÁö ¾Ê´Â´Ù.
	std::cout << "ptr1 (use count " << ptr1.use_count() << ") at " << ptr1.get() << '\n';

}	// Foo::~Foo°¡ ÀÌ ÁöÁ¡¿¡¼­ È£ÃâµÈ´Ù.

À§ ÄÚµå¿¡¼­ º¼ ¼ö ÀÖµíÀÌ, std::shared_ptrÀ» »ç¿ëÇÏ¸é µ¿Àû ¸Ş¸ğ¸®ÀÇ »ı¸íÁÖ±â¸¦ ¾ÈÀüÇÏ°Ô °ü¸®ÇÒ ¼ö ÀÖ´Ù.´õ±º´Ù³ª, ÄÚµå°¡ º¹ÀâÇØÁö°í ¿©·¯
ÇÔ¼ö¿Í °´Ã¼°¡ °°Àº ¸Ş¸ğ¸®¿¡ Á¢±ÙÇØ¾ß ÇÒ ¶§, ÀÌ·¯ÇÑ ½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ÀÌÁ¡Àº ´õ¿í µÎµå·¯Áø´Ù.

´Ù¸¸, std::shared_ptrÀ» »ç¿ëÇÒ ¶§ ÁÖÀÇ ÇÒ Á¡Àº ¼øÈ¯ ÂüÁ¶ ¹®Á¦ÀÌ´Ù.¼­·Î°¡ ¼­·Î¸¦ °¡¸®Å°´Â std::shared_ptr°´Ã¼°¡ »ı¼ºµÇ¸é, ÂüÁ¶ Ä«¿îÅÍ°¡
Àı´ë 0ÀÌ µÇÁö ¾Ê¾Æ ¸Ş¸ğ¸® ´©¼ö°¡ ¹ß»ıÇÑ´Ù.ÀÌ·± »óÈ²À» ¸·±â À§ÇØ '¾àÇÑ Æ÷ÀÎÅÍ'ÀÎ std::weak_ptr¸¦ »ç¿ë ÇÒ ¼ö ÀÖ´Ù.

2. std::shared_ptrÀÇ ±âº» »ç¿ë¹ı

std::shared_ptrÀ» »ç¿ëÇÏ´Â ±âº»ÀûÀÎ ¹æ¹ı¿¡ ´ëÇØ ¾Ë¾Æº¸ÀÚ.¸ÕÀú, ÀÌ ½º¸¶Æ® Æ÷ÀÎÅÍ °´Ã¼´Â ´ÙÀ½°ú °°ÀÌ »ı¼ºÇÒ ¼ö ÀÖ´Ù.

ex)

std::shared_ptr<int> p1(new int(5));
std::shared_ptr<int> p2 = std::make_shared<int>(5);

¿©±â¼­ std::make_shared¸¦ »ç¿ëÇÏ´Â ¹æ¹ıÀÌ ´õ ¼±È£ µÇ´Âµ¥, ÀÌÀ¯´Â µÎ°¡ÁöÀÌ´Ù.Ã¹Â°, std::make_shared¸¦ »ç¿ëÇÏ¸é ¸Ş¸ğ¸® ÇÒ´çÀÌ ÇÑ¹ø¸¸
ÀÌ·ç¾îÁ® ¼º´ÉÀ» Çâ»ó ÇÒ ¼ö ÀÖ´Ù.µÑÂ°, ÀÌ ¹æ½ÄÀº ¿¹¿Ü ¾ÈÁ¤¼ºÀ» º¸ÀåÇÑ´Ù.

ex)

foo(std::shared_ptr<int>(new int(5)), function_may_throw());

À§ ÄÚµå¿¡¼­ function_may_throw()ÀÌ ¿¹¿Ü¸¦ ¹ß»ı ½ÃÅ°¸é, ÀÌ¹Ì ÇÒ´çµÈ new int(5)¿¡ ´ëÇÑ ¸Ş¸ğ¸® ´©¼ö°¡ ¹ß»ıÇÒ ¼ö ÀÖ½À´Ï´Ù.
¹İ¸é, std::make_shared¸¦ »ç¿ëÇÏ¸é ÀÌ·¯ÇÑ ¹®Á¦¸¦ ¹æÁöÇÒ ¼ö ÀÖ´Ù.

ex)
foo(std::make_shared<int>(new int(5), function_may_throw()); // ´õ ¾ÈÀüÇÏ°í ¼±È£µÇ´Â ¹æ½Ä

std::shared_ptr °´Ã¼´Â ´Ù¸¥ ½º¸¶Æ® Æ÷ÀÎÅÍ³ª ÀÏ¹İ Æ÷ÀÎÅÍ·ÎºÎÅÍ º¹»çÇÏ°Å³ª ÀÌµ¿ÇÒ ¼ö ÀÖ´Ù.ÀÌ¶§ ÂüÁ¶ Ä«¿îÅÍ°¡ ÀûÀıÈ÷ Á¶Á¤µÈ´Ù.

ex)
std::shared_ptr<int> p3 = p2; //p3°ú p2´Â °°Àº °´Ã¼¸¦ °¡¸®Å°¸ç, ÂüÁ¶ Ä«¿îÆ®´Â 2ÀÌ´Ù.

´ÙÀ½À¸·Î, std::shared_ptr´Â ÀÏ¹İ Æ÷ÀÎÅÍÃ³·³ µ¿ÀÛÇÏ¸ç, ¸â¹ö Á¢±Ù ¿¬»êÀÚ(->)¿Í ¿ªÂüÁ¶ ¿¬»êÀÚ(*)¸¦ »ç¿ë ÇÒ ¼ö ÀÖ´Ù.

ex)
std::shared_ptr<std::string> p4 = std::make_shared<std::string>("Hello, World!");
std::cout << *p4 << '\n';
std::cout << p4-> size() << '\n' 

std::shared_ptrÀ» »ç¿ëÇÏ¸é ¸Ş¸ğ¸® °ü¸®¿¡ ´ëÇÑ °ÆÁ¤ ¾øÀÌ °øÀ¯¼ÒÀ¯¸¦ Ç¥Çö ÇÒ ¼ö ÀÖ´Ù.

3. std::shared_ptr¿Í ÂüÁ¶ Ä«¿îÆÃ

std::shared_ptrÀÇ ÇÙ½ÉÀûÀÎ Æ¯Â¡ Áß ÇÏ³ª´Â "ÂüÁ¶ Ä«¿îÆÃ"ÀÌ´Ù. ÂüÁ¶ Ä«¿îÆÃÀÌ¶õ std::shared_ptr°´Ã¼°¡ »ı¼ºµÇ°Å³ª ÀÌ¹Ì Á¸ÀçÇÏ´Â
std::shared_ptr°´Ã¼¸¦ º¹»çÇÏ¸é, ÂüÁ¶ Ä«¿îÆ®´Â Áõ°¡ÇÏ¸ç, std::shared_ptr °´Ã¼°¡ ¼Ò¸êµÇ°Å³ª ´Ù¸¥ ¸®¼Ò½º¸¦ °¡¸®Å°°Ô µÉ ¶§ ÂüÁ¶ Ä«¿îÆ®´Â
°¨¼ÒÇÑ´Ù.

ex)
std::shared_ptr<int> p1 =  std::make_shared<int>(5);
std::shared_ptr<int> p2 = p1 // p1À» º¹»çÇÏ¸é ÂüÁ¶ Ä«¿îÆ®°¡ Áõ°¡ÇÑ´Ù.

std::cout << "p1 use cout: " << p1.use_count() << '\n'
std::cout << "p2 use cout: " << p2.use_count() << '\n'

ÂüÁ¶ Ä«¿îÆ®´Â std::shared_ptrÀÇ use_count() ¸Ş¼­µå¸¦ ÅëÇØ ¾Ë ¼ö ÀÖ´Ù. ÇÏÁö¸¸ ÀÌ ¸Ş¼­µå´Â µğ¹ö±ëÀÌ³ª ÇĞ½À ¸ñÀû ¿Ü¿¡ »ç¿ëÀ» ±ÇÀåÇÏÁö ¾Ê´Âµ¥,
±× ÀÌÀ¯´Â use_count()ÀÇ ¹İÈ¯ °ªÀÌ ¼ø°£ÀûÀÎ »óÅÂ¸¦ ¹İ¿µÇÏ±â ‹š¹®¿¡ ¸ÖÆ¼½º·¹µå È¯°æ¿¡¼­´Â ½Å·Ú ÇÒ ¼ö ¾÷½Ã ¶§¹®ÀÌ´Ù.

std::shared_ptr°¡ ÂüÁ¶ Ä«¿îÆ®¸¦ °ü¸®ÇÏ´Â ¹æ½Ä ´öºĞ¿¡, °øÀ¯ÇÏ´Â ¸ğµç std::shared_ptr °´Ã¼°¡ »ç¶óÁö¸é, Áï ÂüÁ¶ Ä«¿îÆ®°¡ 0ÀÌ µÇ¸é ÀÚµ¿À¸·Î
¸Ş¸ğ¸®°¡ ÇØÁ¦µÈ´Ù. ÀÌ·¸°Ô µÇ¸é ¸Ş¸ğ¸® ´©¼ö¸¦ °ÆÁ¤ÇÒ ÇÊ¿ä°¡ ¾ø´Ù.

ex)
{
	std::shared_ptr<int> p3 = std::makesared<int>(10);
	{
		std::shared_ptr<int> p4 = p3;
	}

	std::cout << *p3 << '\n';
}

ÀÌ°ÍÀÌ ¹Ù·Î std:: shared_ptr¿Í ÂüÁ¶ Ä«¿îÆÃÀÇ ±âº»ÀûÀÎ ¿ø¸®ÀÌ´Ù. ÀÌ·± Æ¯¼º ´öºĞ¿¡ std::shared_ptrÀº C++¿¡¼­ ÀÚ¿ø °øÀ¯¸¦ Ç¥ÇåÇÏ´Â °­·ÂÇÑ
µµ±¸ÀÌ´Ù.

4. std::shared_ptrÀÇ ¿¹Á¦ÄÚµå¿Í È°¿ë¹ı

ÀÌÁ¦ ½ÇÁ¦·Î std::shared_ptrÀ» ¾î¶»°Ô »ç¿ëÇÏ´ÂÁö »ìÆìº¼ Â÷·ÊÀÌ´Ù. ¾Æ·¡ ¿¹Á¦¸¦ ÅëÇØ ±âº»ÀûÀÎ »ç¿ë¹æ¹ıÀ» »ìÆìº»´Ù.

ex)
#include <iostram>
#include <memory>

class MyObject
{
public:
	MyObject() { std::cout << "Object created!\n"; }
	~MyObject() { std::cout << "Object destroyed!\n" }
};

int main()
{
	std::shared_ptr<MyObject> ptr1 = std::make_shared<MyObject>();
	{
		std::shared_ptr<MyObject> ptr2 = ptr1;
	}

	return 0;
}

À§ ¿¹Á¦¿¡¼­ MyObject¶ó´Â °£´Ù³­ Å¬·¡½º¸¦ »ı¼ºÇß´Ù. ÀÌ Å¬·¡½º¸¦ »ı¼ºÀÚ¿Í ¼Ò¸êÀÚ¿¡´Â °´Ã¼ÀÇ »ı¼º°ú ¼Ò¸êÀ» ¾Ë¸®´Â ¸Ş½ÃÁö¸¦ Ãâ·ÂÇÏ´Â ÄÚµå°¡
µé¾î ÀÖ´Ù.

main ÇÔ¼ö¿¡¼­´Â std::make_shared ÇÔ¼ö¸¦ ÀÌ¿ëÇÏ¿© MyObejct°´Ã¼¸¦ »ı¼ºÇÏ°í std::shared_ptr¿¡ ÇÒ´çÇß´Ù. ±×¸®°í ³»ºÎ ºí·Ï¿¡¼­ ptr1À» º¹»çÇÏ¿©
ptr2¸¦ »ı¼ºÇÑ´Ù. ÀÌ·¸°Ô µÇ¸é ptr1°ú ptr2´Â µ¿ÀÏÇÑ MyObject °´Ã¼¸¦ °¡¸®Å°¸ç, ÂüÁ¶ Ä«¿îÆ®´Â 2°¡ µÈ´Ù.

³»ºÎ ºí·ÏÀÌ Á¾·áµÇ¸é ptr2°¡ ¼Ò¸êµÇ°í ÂüÁ¶ Ä«¿îÆ®´Â 1·Î ÁÙ¾îµç´Ù. ÇÏÁö¸¸ ¿©ÀüÈ÷ ptr1ÀÌ MyObject°´Ã¼¸¦ °¡¸®Å°°í ÀÖÀ¸¹Ç·Î °´Ã¼´Â ¼Ò¸êµÇÁö
¾Ê´Â´Ù. mainÇÔ¼ö°¡ Á¾·áµÇ¸é ptr1ÀÌ ¼Ò¸êµÇ°í ÂüÁ¶ Ä«¿îÆ®°¡ 0ÀÌ µÇ¾î, ÀÌ ½ÃÁ¡¿¡¼­ MyObject °´Ã¼°¡ ¼Ò¸êµÈ´Ù.

ÀÌÃ³·³ std::shared_ptr¸¦ »ç¿ëÇÏ¸é ÀÚµ¿À¸·Î ÂüÁ¶ Ä«¿îÆ®¸¦ °ü¸® ÇØ ÁÖ±â ‹š¹®¿¡, ¿ì¸®´Â ¸í½ÃÀûÀ¸·Î ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇØ ÁÖ´Â ÄÚµå¸¦ ÀÛ¼ºÇÒ ÇÊ¿ä°¡
¾ø½À´Ï´Ù. ¶ÇÇÑ ÂüÁ¶ Ä«¿îÆ®°¡ 0ÀÌ µÇ´Â ½ÃÁ¡¿¡¼­ °´Ã¼°¡ ¼Ò¸êµÇ¹Ç·Î ¸Ş¸ğ¸® ´©¼ö¸¦ ¹æÁö ÇÒ ¼ö ÀÖ´Ù.

ÀÌ ¿Ü¿¡µµ std::shared_ptr´Â ¿ø½Ã Æ÷ÀÎÅÍ Ã³·³ »ç¿ë ÇÒ ¼ö ÀÖ´Ù. Áï, *¿¬»êÀÚ¸¦ ÀÌ¿ëÇÏ¿© °´Ã¼¿¡ Á¢±Ù ÇÒ ¼ö ÀÖ°í, -> ¿¬»êÀÚ¸¦ ÀÌ¿ëÇÏ¿© °´Ã¼ÀÇ
¸â¹ö¿¡ Á¢±Ù ÇÒ ¼ö ÀÖ´Ù. 

ex)
#include <iostream>
#include <memory>

class MyObject
{
public:
	MyObject(int val) : value(val) {}
	int value;
};

int main()
{
	std::shared_ptr<MyObject> ptr = std::make_shared<MyObject>(10);
	std::cout << "Value" << ptr->value << "\n";
	return 0;
}

À§ ¿¹Á¦ÀÌ¼­´Â MyObject °´Ã¼¿¡ value¶ó´Â ¸â¹ö º¯¼ö¸¦ Ãß°¡Çß´Ù.±×¸®°í std::make_shared ÇÔ¼ö¸¦ ÀÌ¿ëÇÏ¿© MyObject°´Ã¼¸¦ »ı¼ºÇÒ ¶§ value¸¦
ÃÊ±âÈ­ Çß´Ù.ÀÌÈÄ ptr->value¸¦ ÀÌ¿ëÇÏ¿© value¿¡ Á¢±ÙÇÏ¿´´Ù.

µû¶ó¼­ std::shared_ptr¸¦ ÀÌ¿ëÇÏ¸é ¸Ş¸ğ¸® °ü¸®¸¦ ÀÚµ¿È­ ÇÒ ¼ö ÀÖÀ¸¸é¼­µµ ¿ø½Ã Æ÷ÀÎÅÍ¿Í À¯»çÇÑ ¹æ½ÄÀ¸·Î ÄÚµå¸¦ ÀÛ¼º ÇÒ ¼ö ÀÖ´Ù.ÀÌ·¯ÇÑ Æ¯¼º
´öºĞ¿¡ std::shared_ptr´Â C++¿¡¼­ ÀÚÁÖ »ç¿ëµÇ´Â ½º¸¶Æ® Æ÷ÀÎÅÍ Áß ÇÏ³ªÀÌ´Ù.

5. std::shared_ptr ¿¹¿Ü Ã³¸®

C++¿¡¼­ ¿¹¿ÜÃ³¸®´Â Áß¿äÇÑ ºÎºĞ...(¾Æ±î Çß´ø ÀÌ¾ß±â)
ÀÌ´Â ¸Ş¸ğ¸® °ü¸®¿Í ¹ĞÁ¢ÇÑ °ü·ÃÀÌ ÀÖ´Âµ¥, std::shared_ptrÀº ÀÌ·¯ÇÑ ¹®Á¦¸¦ Ã³¸®ÇÏ´Âµ¥ À¯¿ëÇÑ µµ±¸ÀÌ´Ù.

[¿¹¿Ü¿Í ¸Ş¸ğ¸® ´©¼ö]

¸ÕÀú, ¿¹¿Ü¿Í ¸Ş¸ğ¸® ´©¼ö¿¡ ´ëÇÑ ¹®Á¦¸¦ ÀÌÇØ ÇØ º¸ÀÚ.

#inlcude <iostream>
#include <stdexcept>

class MyObject
{
public:
	MyObject() {std::cout << "Object created!\n" }
	~MyObject() {std::cout << "Object destroyed!\n" }
};

void riskyFunction()
{
	MyObject* obj = new MyObject();
	throw std::runtime_error("Exception occurred!");
	delete obj
}

int main()
{
	try
	{
		riskyFUntion();
	}

	catch (const std::exception& e)
	{
		std::cerr << "Caight exception: " << e.what() << '\n';
	}

	return 0;
}

À§ÀÇ riskyFunction¿¡¼­´Â MyObject¸¦ µ¿ÀûÀ¸·Î »ı¼ºÇÏ°í, ÀÌÈÄ¿¡ ¿¹¿Ü¸¦ ¹ß»ı½ÃÅ²´Ù.¿¹¿Ü°¡ ¹ß»ıÇÏ¸é delete obj; ÄÚµå´Â ½ÇÇàµÇÁö ¾Ê°í, ÀÌ·Î
ÀÎÇØ ¸Ş¸ğ¸® ´©¼ö°¡ ¹ß»ıÇÑ´Ù.

[std::shared_ptr¸¦ »ç¿ëÇÑ ¾ÈÀüÇÑ ÄÚµå]

std::shared_ptrÀ» »ç¿ëÇÏ¸é À§¿Í °°Àº ¹®Á¦¸¦ ½±°Ô ÇØ°á ÇÒ ¼ö ÀÖ´Ù. std::shared_ptrÀ» »ç¿ëÇÏ¿© °´Ã¼¸¦ »ı¼ºÇÏ¸é, std::shared_ptrÀÌ ÀÚµ¿À¸·Î
¸Ş¸ğ¸®¸¦ °ü¸®ÇÏ¹Ç·Î ¸í½ÃÀûÀ¸·Î delete¸¦ È£ÃâÇÒ ÇÊ¿ä°¡ ¾ø´Ù. ÀÌ¸¦ ÅëÇØ ¸Ş¸ğ¸® ´©¼ö¸¦ ¹æÁö ÇÒ ¼ö ÀÖ´Ù.

ex)
#include <iostream>
#include <stdexcept>
#include <memory>

class MyObject
{
public:
	MyObject() { std::cout << "Object created!\n"; }
	~MyObject() { std::cout << "Object destroyed!\n"; }
};

void safeFunction()
{
	std::shared_ptr<MyObject> obj = std::make_shared<MyObject>();
	throw std::runtime_error("Exception occurred!"):
}

int main()
{
	try {
		safeFunction();
	}

	catch (const std::exception& e)
	{
		std:: cerr << "Caught exception: " << e.what << "\n"
	}

	return 0;
}

À§ ÄÚµå¿¡¼­ safeFUnctionÀº std::shared_ptrÀ» »ç¿ëÇÏ¿© MyObject¸¦ »ı¼ºÇÑ´Ù. ÀÌÈÄ ¿¹¿Ü°¡ ¹ß»ıÇÏ´õ¶óµµ std::shared_ptrÀÌ ¼Ò¸ê µÉ ¶§,
MyObject°¡ ÀÚµ¿À¸·Î »èÁ¦µÇ¹Ç·Î ¸Ş¸ğ¸® ´©¼ö°¡ ¹ß»ıÇÏÁö ¾Ê´Â´Ù.

ÀÌÃ³·³ std::shared_ptrÀº ¿¹¿Ü ¾ÈÁ¤¼ºÀ» °­È­ÇÏ´Âµ¥ À¯¿ëÇÏ´Ù. ÀÌ µµ±¸¸¦ »ç¿ëÇÏ¸é ¿¹¿Ü »óÈ²¿¡¼­µµ ¸Ş¸ğ¸® ´©¼ö¸¦ ¹æÁöÇÏ°í, ÄÚµå¸¦ ´õ ¾ÈÀüÇÏ°Ô
¸¸µé ¼ö ÀÖ´Ù.

[std::weak_ptr¿¡ ´ëÇØ]

std::weak_ptr´Â C++ ½º¸¶Æ® Æ÷ÀÎÅÍ Áß ÇÏ³ª·Î, std::shared_ptr¿Í °°ÀÌ ÂüÁ¶ Ä«¿îÆÃÀ» »ç¿ëÇÏÁö¸¸, ÂüÁ¶ Ä«¿îÆ®¿¡ ¿µÇâÀ» ÁÖÁö ¾Ê´Â´Ù. ÀÌ´Â ¼øÈ¯
ÂüÁ¶ ¹®Á¦¸¦ ¹æÁöÇÏ±â À§ÇØ »ç¿ëµÈ´Ù. ¼øÈ¯ ÂüÁ¶¶õ ¼­·Î°¡ ¼­·Î¸¦ ÂüÁ¶ÇÏ´Â »óÈ²À¸·Î, ½º¸¶Æ® Æ÷ÀÎÅÍ°¡ ÀÚµ¿À¸·Î ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÏÁö ¸øÇÏ°Ô ¸¸µç´Ù.
std::weak_ptr¸¦ »ç¿ëÇÏ¸é ÀÌ·¯ÇÑ ¹®Á¦¸¦ ÇÇÇÒ ¼ö ÀÖ´Ù.

weak_ptrÀÇ Á¤ÀÇ¿Í Æ¯Â¡

C++ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ Áß ÇÏ³ªÀÎ std::weak_ptr´Â ÀÌ¸§¿¡¼­µµ ¾Ë ¼ö ÀÖµíÀÌ, '¾àÇÑ Æ÷ÀÎÅÍ'¸¦ ÀÇ¹Ì ÇÑ´Ù. ÀÌ Æ÷ÀÎÅÍ´Â std::shared_ptr¿Í ¿¬µ¿µÇ¾î
ÀÛµ¿ÇÏ¸ç, °¡Àå Å« Æ¯Â¡Àº ÂüÁ¶ Ä«¿îÆ®¿¡ ¿µÇâÀ» ¹ÌÄ¡Áö ¾Ê´Â´Ù´Â °ÍÀÌ´Ù. Áï, std::weak_ptrÀÌ °¡¸®Å°´Â °´Ã¼¸¦ ÂüÁ¶ÇÏ´Â µ¿¾È¿¡´Â ÇØ´ç °´Ã¼°¡
¸Ş¸ğ¸®¿¡¼­ »ç¶óÁöÁö ¾ÊÁö¸¸, ÂüÁ¶ Ä«¿îÆ®¿¡´Â ¹İ¿µµÇÁö ¾Ê¾Æ std::shared_ptrÃ³·³ ¸Ş¸ğ¸® ÇØÁ¦¿¡ ¿µÇâÀ» ¹ÌÄ¡Áö ¾Ê´Â´Ù.

ÀÌ Æ¯Â¡Àº ¼øÈ¯ ÂüÁ¶ ¹®Á¦¸¦ ÇØ°áÇÏ´Âµ¥ ¾ÆÁÖ Áß¿äÇÑ ¿ªÇÒÀ» ÇÑ´Ù. ¼øÈ¯ ÂüÁ¶´Â µÎ °´Ã¼°¡ ¼­·Î ÂüÁ¶ ÇÒ ¶§ »ı±â´Â ¹®Á¦·Î, ÀÌ·± »óÈ²¿¡¼­´Â °¢ °³Ã¼ÀÇ
ÂüÁ¶ Ä«¿îÅÍ°¡ 0ÀÌ µÇÁö ¾Ê¾Æ ¿µ¿øÈ÷ ¸Ş¸ğ¸®¿¡¼­ ÇØÁ¦µÇÁö ¾Ê´Â ¹®Á¦°¡ ¹ß»ıÇÑ´Ù. std::weak_ptrÀÌ ¼Ò¸êµÇ¾úÀ» ¶§ °´Ã¼´Â ¸Ş¸ğ¸®¿¡¼­ ÇØÁ¦µÈ´Ù.

ex)
#include <iostream>
#include <memory>

struct MyClass
{
	std::weak_ptr<MtClass> ptr;
	~MyClass() { std::cout << "MyClass destroyed\n"; }
};

int main()
{
	std::shared_ptr<MyClass> sp = std::make_shared<MyClass>();
	sp->ptr = sp;

	return 0;
}

ÀÌ ÄÚµå¿¡¼­´Â, MyClass °´Ã¼°¡ ÀÚ½ÅÀ» °¡¸®Å°´Â weak_ptrÀ» ¸â¹ö·Î °¡Áö°í ÀÖ´Ù. ¸ŞÀÎ ÇÔ¼ö¿¡¼­´Â shared_ptrÀ» »ı¼ºÇÏ°í, ÀÌ shared_ptrÀÌ ÀÚ½ÅÀ»
°¡¸®Å°°Ô ÇÑ´Ù. ±×·¯³ª ÀÌ °æ¿ì¿¡µµ MyClass °´Ã¼´Â ÇÁ·Î±×·¥ÀÌ Á¾·á µÉ ¶§ Á¤»óÀûÀ¸·Î ÇØÁ¦µÈ´Ù. ÀÌ°ÍÀº weak_ptrÀÌ ÂüÁ¶ Ä«¿îÆ®¿¡ ¹İ¿µµÇÁö ¾Ê±â
‹š¹®ÀÌ´Ù.

ÀÌ·¸°Ô std::weak_ptrÀº std::shared_ptr°ú ÇÔ²² »ç¿ëÇÏ¿© ¼øÈ¯ ÂüÁ¶ ¹®Á¦¸¦ ÇØ°áÇÏ´Âµ¥ ¾ÆÁÖ Áß¿äÇÑ µµ±¸ÀÌ´Ù. 

ÂüÁ¶ Ä«¿îÆ®¿¡ ¹İ¿µµÇÁö ¾Ê´Â std::Weak_ptrÀÇ Æ¯¼º ‹š¹®¿¡, weak_ptr°¡ °¡¸®Å°´Â °´Ã¼¸¦ Á÷Á¢ Á¢±Ù ÇÒ ¼ö´Â ¾ø´Ù. ÀÌ¸¦ À§ÇØ¼­´Â std::shared_ptr·Î
º¯È¯ÇØ¾ß ÇÏ´Âµ¥, ÀÌ °úÁ¤À» '¶ô(lock)'ÀÌ¶ó°í ÇÑ´Ù. std::weak_ptrÀÇ lock¸Ş¼­µå¸¦ È£ÃâÇÏ¿© std::shared_ptr¸¦ ¾òÀ» ¼ö ÀÖ´Ù.

ex)

#include <iostream>
#include <memory>

int main()
{
	std::shared_ptr<int> sp = std::make_shared<int>(123);
	std::weak_ptr<int> wp = sp;

	if (std::shared_ptr<int> locked = wp.lock())
	{
		std::cout << " *locked" << *locked << '\n';
	}

	else
	{
		std::cout << "wp is expired\n";
	}

	return 0;
}

ÀÌ ÄÚµå¿¡¼­´Â, ¸ÕÀú shared_ptrÀ» »ı¼ºÇÏ°í, ÀÌ¸¦ weak_ptr·Î º¹»çÇÑ´Ù.±×·± ´ÙÀ½ lock ¸Ş¼­µå¸¦ »ç¿ëÇÏ¿© weak_ptr¿¡¼­ shared_ptr¸¦ ¾ò°í, ÀÌ¸¦
ÅëÇØ °´Ã¼¿¡ Á¢±Ù ÇÑ´Ù.ÀÌ ¹æ¹ıÀ¸·Î °´Ã¼°¡ ¾ÆÁ÷ ¸Ş¸ğ¸®¿¡ ÀÖ´ÂÁö È®ÀÎ ÇÒ ¼ö ÀÖ´Ù.¸¸¾à °´Ã¼°¡ ¸Ş¸ğ¸®¿¡¼­ ÇØÁ¦µÇ¾ú´Ù¸é, lock ¸Ş¼­µå´Â ºó
shared_ptr¸¦ ¹İÈ¯ÇÑ´Ù.

µû¶ó¼­, std::weak_ptr´Â °´Ã¼°¡ ¾ÆÁ÷ ¸Ş¸ğ¸®¿¡ ÀÖ´ÂÁö È®ÀÎÇÏ´Â µ¥ »ç¿ë ÇÒ ¼ö ÀÖ´Â ÈÇ·æÇÑ µµ±¸ÀÌ´Ù.std::shared_ptr¿Í ÇÔ²² »ç¿ëÇÏ¸é, ¸Ş¸ğ¸®
´©¼ö¸¦ ¹æÁöÇÏ°í, °´Ã¼ÀÇ »ı¸í ÁÖ±â¸¦ ¾ÈÀüÇÏ°Ô °ü¸® ÇÒ ¼ö ÀÖ´Ù.

ÁÖ¸ñÇÒ Á¡Àº, std::weak_ptr´Â °´Ã¼¿¡ Á¢±Ù ÇÏ±â Àü¿¡ Ç×»ó lock ¸Ş¼­µå¸¦ È£ÃâÇÏ¿© °´Ã¼°¡ ¾ÆÁ÷ ¸Ş¸ğ¸®¿¡ ÀÖ´ÂÁö È®ÀÎÇØ¾ß ÇÑ´Ù´Â °ÍÀÌ´Ù.ÀÌ´Â
std::weak_ptrÀÇ ÇÙ½ÉÀûÀÎ Æ¯¼ºÀÌÀÚ »ç¿ë¹æ¹ıÀÌ´Ù.

2. weak_ptrÀÇ ±âº» »ç¿ë¹ı

C++ÀÇ std::weak_ptr´Â °øÀ¯µÈ ¼ÒÀ¯±Ç(std::shared_ptr)ÀÇ ¹®Á¦¸¦ ÇØ°áÇÏ±â À§ÇØ µµÀÔµÈ ½º¸¶Æ® Æ÷ÀÎÅÍÀÌ´Ù.ÀÌ ½º¸¶Æ® Æ÷ÀÎÅÍ´Â ÂüÁ¶ Ä«¿îÆÃÀ»
Áõ°¡½ÃÅ°Áö ¾Ê¾Æ ¼øÈ¯ ÂüÁ¶ ¹®Á¦¸¦ ¹æÁö ÇÒ ¼ö ÀÖ´Ù.ÇÏÁö¸¸, std::weak_ptr´Â °´Ã¼¿¡ ´ëÇÑ '¾àÇÑ' ÂüÁ¶¸¸À» Á¦°øÇÏ¹Ç·Î, °´Ã¼¿¡ Á÷Á¢ Á¢±ÙÇÏ·Á¸é ¸ÕÀú
std::shared_pr·Î º¯È¯ÇØ¾ß ÇÑ´Ù.ÀÌ¸¦ '¶ô(lock)'ÀÌ¶ó°í ºÎ¸¥´Ù.

¸ÕÀú, std::weak_ptrÀ» »ı¼ºÇÏ´Â ¹æ¹ıÀÌ´Ù.std::weak_ptr´Â ±âº»ÀûÀ¸·Î std::shared_ptr ¿¡¼­ »ı¼ºµÈ´Ù.

ex)
std::shared_ptr<int> sp(new int(10));
std::weak_ptr<int> wp(sp));

À§ÀÇ ÄÚµå¿¡¼­ wp´Â sp°¡ ¼ÒÀ¯ÇÑ °´Ã¼¸¦ °¡¸®Å°Áö¸¸, ÀÌ´Â '¾àÇÑ' ÂüÁ¶ÀÌ¹Ç·Î spÀÇ ÂüÁ¶ Ä«¿îÆ®¸¦ Áõ°¡½ÃÅ°Áö ¾Ê´Â´Ù. Áï, wp´Â °´Ã¼ÀÇ ¼ÒÀ¯±ÇÀ» °¡ÁöÁö
¾Ê´Â´Ù.

°´Ã¼¿¡ Á¢±Ù ÇÏ·Á¸é, ¸ÕÀú std::shared_ptr·Î º¯È¯ÇØ¾ß ÇÑ´Ù. ÀÌ¸¦ À§ÇØ std::weak_ptrÀÇ lock¸Ş¼­µå¸¦ »ç¿ëÇÑ´Ù.

ex)

if (std::shared_ptr<int>sp = wp.lock()) // lock ¸Ş¼­µå·Î shared_ptrÈ¹µæ
{
	//°´Ã¼¿¡ Á¢±Ù
}

lock ¸Ş¼­µå´Â ÇØ´ç °´Ã¼°¡ ¾ÆÁ÷ ¸Ş¸ğ¸®¿¡ ÀÖÀ» ¶§ std::shared_ptr·ê ¹İÈ¯ÇÏ¸ç, ±×·¸Áö ¾ÊÀ» ¶§´Â ºó std::shared_ptr¸¦ ¹İÈ¯ÇÑ´Ù. µû¶ó¼­ lock
¸Ş¼­µå¸¦ »ç¿ëÇÏ¿© °´Ã¼°¡ ¸Ş¸ğ¸®¿¡ ÀÖ´ÂÁö È®ÀÎ ÇÒ ¼ö ÀÖ´Ù.

¶ÇÇÑ std::weak_ptr´Â expired ¸Ş¼Òµå¸¦ Á¦°øÇÏ¿© °´Ã¼°¡ ¸Ş¸ğ¸®¿¡ ÀÖ´ÂÁö È®ÀÎ ÇÒ ¼ö ÀÖ´Ù.

ex)
if (wp.expired())
{
	// °´Ã¼´Â ´õ ÀÌ»ó ¸Ş¸ğ¸®¿¡ ¾øÀ½
}

ÇÏÁö¸¸, ÀÌ ¸Ş¼Òµå´Â °´Ã¼ÀÇ »óÅÂ¸¦ È®ÀÎÇÏ°í °´Ã¼¿¡ Á¢±ÙÇÏ´Â »çÀÌ¿¡ °´Ã¼°¡ ÇØÁ¦ µÉ ¼ö ÀÖÀ¸¹Ç·Î, ¾ÈÀüÇÑ °´Ã¼ Á¢±ÙÀ» À§ÇØ¼­´Â Ç×»ó lock ¸Ş¼­µå¸¦
»ç¿ëÇØ¾ß ÇÑ´Ù.

3. weak_ptr¿Í ¼øÈ¯ ÂüÁ¶ ¹®Á¦

½º¸¶Æ® Æ÷ÀÎÅÍ´Â ¸Ş¸ğ¸® °ü¸®¸¦ ÇöÇÏ°Ô ÇØÁÖÁö¸¸, std::shared_ptr¸¦ »ç¿ëÇÒ ¶§ ÁÖÀÇ ÇØ¾ß ÇÒ ÁÖ¿äÇÑ ¹®Á¦°¡ ÀÖ´Ù.¹Ù·Î '¼øÈ¯ÂüÁ¶(circular
reference)' ¹®Á¦ÀÌ´Ù. ÀÌ ¹®Á¦´Â ¼­·Î°¡ ¼­·Î¸¦ ÂüÁ¶ÇÏ´Â µÎ°³ÀÇ std::shared_ptr °´Ã¼°¡ ÀÖÀ» ‹š ¹ß»ıÇÑ´Ù. ÀÌ·¸°Ô µÇ¸é ÂüÁ¶ Ä«¿îÆ®´Â °áÄÚ 0ÀÌ
µÉ ¼ö ¾øÀ¸¹Ç·Î, ÀÌ·¯ÇÑ °´Ã¼µéÀº ¸Ş¸ğ¸®¿¡¼­ Àı´ë ÇØÁ¦µÇÁö ¾Ê°Ô µÈ´Ù.ÀÌ°ÍÀÌ ¹Ù·Î ¸Ş¸ğ¸® ´©¼ö(memory leak)¸¦ ÀÏÀ¸Å°´Â ¿øÀÎÀÌ µÈ´Ù.

ÀÌ ¹®Á¦¸¦ ÇØ°áÇÏ±â À§ÇØ¼­ std::weak_ptr°¡ µîÀåÇß´Ù.std::weak_ptr´Â std::shared_ptr¿Í ´Ş¸® ÂüÁ¶ Ä«¿îÆ®¸¦ Áõ°¡½ÃÅ°Áö ¾Ê±â ¶§¹®¿¡ ¼øÈ¯ ÂüÁ¶¸¦
¹æÁö ÇÒ ¼ö ÀÖ´Ù.

4. weak_ptrÀÇ ¿¹Á¦ ÄÚµå¿Í È°¿ë¹ı
weak_ptr´Â std::shared_ptr¿Í ÇÔ²² »ç¿ëµÇ¿© ¼øÈ£³ª ÂüÁ¶ ¹®Á¦¸¦ ÇØ°áÇÏ°í, Æ¯Á¤ °´Ã¼°¡ ¿©ÀüÈ÷ ¸Ş¸ğ¸®¿¡ Á¸ÀçÇÏ´ÂÁö ÆÇ´Ü ÇÒ ¼ö ÀÖ´Â ¹æ¹ıÀ» Á¦°ø
ÇÑ´Ù.±×·¸´Ù¸é ÀÌÁ¦ std::weak_ptrÀÇ ±âº»ÀûÀÎ »ç¿ë¹ı°ú ¿¹Á¦ ÄÚµå¸¦ ÅëÇØ ½ÇÁ¦·Î ¾î¶»°Ô È°¿ëÇÒ ¼ö ÀÖ´ÂÁö ¾Ë¾Æº¸ÀÚ.

¸ÕÀú, std::weak_ptr´Â ±âº»ÀûÀ¸·Î std::shared_ptr¿¡¼­ »ı¼ºµÈ´Ù.

ex)
std::shared_ptr<int> sp(new int(10));
std::weak_ptr<int> wp = sp;

À§ÀÇ ÄÚµå¿¡¼­ wp´Â sp·Î ºÎÅÍ »ı¼ºµÈ std::weak_ptrÀÌ´Ù.ÀÌ¶§ wp´Â sp°¡ °¡¸®Å°´Â ¸Ş¸ğ¸®¿¡ ´ëÇÑ ¾àÇÑ ÂüÁ¶(weak reference)¸¦ °¡Áö°Ô µÈ´Ù.±×·¯³ª
wp´Â ÂüÁ¶ Ä«¿îÆ®¸¦ Áõ°¡½ÃÅ°Áö ¾ÊÀ¸¹Ç·Î, sp°¡ ¼Ò¸êµÇ¸é wp´Â ´õ ÀÌ»ó À¯È¿ÇÑ ÂüÁ¶¸¦ °¡ÁöÁö ¾Ê°Ô µÈ´Ù.

±×·³¿¡µµ ºÒ±¸ÇÏ°í wp¸¦ ÅëÇØ ¾ÈÀüÇÏ°Ô ¸Ş¸ğ¸®¿¡ Á¢±ÙÇÏ·Á¸é ¾î¶»°Ô ÇØ¾ß ÇÒ±î¿ä ? ¿©±â¼­´Â std::weak_ptrÀÇ lockÇÔ¼ö¸¦ »ç¿ë ÇÒ ¼ö ÀÖ´Ù.lock ÇÔ¼ö´Â
std::shared_ptr¸¦ ¹İÈ¯ÇÏ¸ç, ÀÌ std::shared_ptr¸¦ ÅëÇØ ¾ÈÀüÇÏ°Ô ¸Ş¸ğ¸®¿¡ Á¢±Ù ÇÒ ¼ö ÀÖ´Ù.

ex)
std::shared_ptr<int> sp(new int(10));
std::weak_ptr<int> wp = sp;

if (auto p = wp.lock()) //wp°¡ À¯È¿ÇÑÁö È®ÀÎÇÏ°í, À¯È¿ÇÏ´Ù¸é shared_ptr¸¦ ¾ò´Â´Ù.
{	// ¾ÈÀüÇÏ°Ô ¸Ş¸ğ¸®¿¡ Á¢±Ù ÇÒ ¼ö ÀÖ´Ù.
	std::cout << *p << std::endl;
}
else
{	// wp°¡ ´õÀÌ»ó À¯È¿ÇÏÁö ¾Ê´Â »óÅÂ
	std::cout << "wp is no longer valid << std::endl";
}

5. weak_ptr ¿¹¿Ü Ã³¸®

C++¿¡¼­ std::weak_ptr¸¦ »ç¿ëÇÏ¸é¼­ ¿¹¿Ü Ã³¸®¸¦ ÀûÀıÈ÷ ÇÏ´Â °ÍÀº ¸Å¿ì Á¾¿äÇÏ´Ù.ÀÌ´Â weak_ptr°¡ °¡¸®Å°´Â ¸Ş¸ğ¸®¿¡ Á¢±Ù ÇÒ ¼ö ¾øÀ» ¶§ »ı±â´Â
¿¹¿Ü »óÈ²À» Ã³¸®ÇÏ±â À§ÇÔÀÌ´Ù.

std::weak_ptr´Â std::shared_ptr°¡ °¡¸®Å°´Â ¸Ş¸ğ¸®¿¡ ´ëÇÑ ¾àÇÑ ÂüÁ¶¸¦ °¡Áö¹Ç·Î, std::shared_ptr°¡ ¼Ò¸ê µÇ¸é std::weak_ptr´Â ´õÀÌ»ó À¯È¿ÇÑ
ÂüÁ¶¸¦ °¡ÁöÁö ¾Ê°Ô µÈ´Ù.ÀÌ·¸°Ô std::weak_ptr°¡ ´õ ÀÌ»ó À¯È¿ÇÏÁö ¾ÊÀº »óÅÂ¿¡¼­ ¸Ş¸ğ¸®¿¡ Á¢±ÙÇÏ·Á°í ÇÏ¸é ¹®Á¦°¡ ¹ß»ıÇÑ´Ù.

std::weak_ptr¿¡¼­ Á¦°øÇÏ´Â lock ÇÔ¼ö¸¦ ÀÌ¿ëÇÏ¸é ¾ÈÀüÇÏ°Ô ¸Ş¸ğ¸®¿¡ Á¢±Ù ÇÒ ¼ö ÀÖ´Ù.lock ÇÔ¼ö´Â std::shared_ptr¸¦ ¹İÈ¯ÇÏ¸ç, ÀÌ std::shared_ptr
¸¦ ÅëÇØ ¸Ş¸ğ¸®¿¡ Á¢±Ù ÇÒ ¼ö ÀÖ´Ù.¸¸¾à std::weak_ptr°¡ À¯È¿ÇÏÁö ¾Ê´Ù¸é lock ÇÔ¼ö´Â nullptr¸¦ °¡¸®Å°´Â std::shared_ptr¸¦ ¹İÈ¯ÇÑ´Ù.

ex)
std::shared_ptr<int> sp(new int()10);
std::weak_ptr<int>wp = sp;

sp.reset();	// sp¸¦ resetÇÏ¿© ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÑ´Ù.

if (auto p = wp.lock())
{
	std::cout << *p << std::endl;
}

else
{
	std::cout << "wp is no longer valid" << std::endl;
}

À§ÀÇ ÄÚµå¿¡¼­ wp.lock()Àº std::shared_ptr¸¦ ¹İÈ¯ÇÑ´Ù. ¸¸¾à wp°¡ À¯È¿ÇÏ´Ù¸é ÀÌ std::shared_ptr¸¦ ÅëÇØ ¸Ş¸ğ¸®¿¡ ¾ÈÀüÇÏ°Ô Á¢±Ù ÇÒ ¼ö ÀÖ´Ù.
¹İ¸é wp°¡ ´õ ÀÌ»ó À¯È¿ÇÏÁö ¾Ê´Ù¸é, lock ÇÔ¼ö´Â nullptr¸¦ °¡¸®Å°´Â std::shared_ptr¸¦ ¹İÈ¯ÇÏ¹Ç·Î ¾ÈÀüÇÏ°Ô ¿¹¿Ü »óÈ²À» Ã³¸® ÇÒ ¼ö ÀÖ´Ù.

ÀÌÃ³·³ std::weak_ptr´Â lock ÇÔ¼ö¸¦ ÅëÇØ ¾ÈÀüÇÏ°Ô ¸Ş¸ğ¸®¿¡ Á¢±Ù ÇÒ ¼ö ÀÖ°Ô ÇØ ÁÖ¸ç, ´õ ÀÌ»ó À¯È¿ÇÏÁö ¾Ê´Â ÂüÁ¶¿¡ ´ëÇÑ ¿¹¿Ü »óÈ²À» ÀûÀıÈ÷ Ã³¸®
ÇÒ ¼ö ÀÖ´Ù. ÀÌ·¯ÇÑ ±â´ÉÀº ¸Ş¸ğ¸® °ü¸®¸¦ ´õ¿í ¾ÈÀüÇÏ°í È¿À²ÀûÀ¸·Î ¸¸µé¾î ÁØ´Ù.

¸¶Áö¸·À¸·Î, std::weak_ptr´Â ¼öÈ¯ ÂüÁ¶¿Í °°Àº ¹®Á¦¸¦ ¹æÁöÇÏ¸é¼­µµ µ¿½Ã¿¡ ¾ÈÀüÇÏ°Ô ¸Ş¸ğ¸®¸¦ °ü¸® ÇÒ ¼ö ÀÖ°Ô ÇØÁÖ´Â ¸Å¿ì À¯¿ëÇÑ µµ±¸ÀÌ´Ù. ÀÌ¸¦
ÀûÀıÈ÷ È°¿ëÇÏ¿© ÇÁ·Î±×·¥ÀÇ ¾ÈÁ¤¼ºÀ» ³ôÀÏ ¼ö ÀÖ´Ù.

[»ç¿ëÀÚ Á¤ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ]
C++¿¡¼­´Â »ç¿ëÀÚ Á¤ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ¸¦ »ı¼ºÇÏ¿© ÇÁ·Î±×·¥ÀÇ Æ¯Á¤ ¿ä±¸»çÇ×À» ÃæÁ·½ÃÅ³ ¼ö ÀÖ´Ù. »ç¿ëÀÚ Á¤ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ´Â ±âº» Á¦°øµÇ´Â
std::unique_ptr, std::shared_ptr, std::weak_ptrµîÀ¸·Î ÃæºĞÇÏÁö ¾ÊÀº °æ¿ì¿¡ À¯¿ëÇÏ°Ô »ç¿ë ÇÒ ¼ö ÀÖ´Ù. ÀÌ¸¦ ¸¸µé±â À§ÇØ¼­´Â ¿¬»êÀÚ ¿À¹ö·Îµù,
»ı¼ºÀÚ¿Í ¼Ò¸êÀÚÀÇ ÀûÀıÇÑ »ç¿ë, º¹»ç »ı¼ºÀÚ¿Í º¹»ç ´ëÀÔ ¿¬»êÀÚÀÇ °ü¸® µî¿¡ ´ëÇÑ ±íÀº ÀÌÇØ°¡ ÇÊ¿äÇÏ´Ù. »ç¿ëÀÚ Á¤ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ´Â ¸Ş¸ğ¸® »Ó
¾Æ´Ï¶ó, ³×Æ®¿öÅ© ¿¬°áÀÌ³ª ÆÄÀÏ ÇÚµé µî ´Ù¾çÇÑ ÀÚ¿øÀ» °ü¸® ÇÏ´Â µ¥¿¡µµ È°¿ë ÇÒ ¼ö ÀÖ´Ù.

1. »ç¿ëÀÚ Á¤ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ ±¸ÇöÇÏ±â

¿ì¼±, »ç¿ëÀÚ Á¤ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ°¡ ÇÊ¿äÇÑ ÀÌÀ¯¸¦ ¾Ë¾Æº¸ÀÚ. C++ÀÇ STL¶óÀÌºê·¯¸®´Â ÀÌ¹Ì ½º¸¶Æ® Æ÷ÀÎÅÍ ¶óÀÌºê·¯¸®¸¦ Á¦°øÇÏÁö¸¸, ¶§·Î´Â Æ¯Á¤ ¿ä±¸
»çÇ×À» ÃæÁ·ÇÏ±â À§ÇØ »ç¿ëÀÚ Á¤ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍ¸¦ ¸¸µå´Â °ÍÀÌ ÇÊ¿äÇÏ´Ù.

»ç¿ëÀÚ Á¤ÀÇ ¹Ç»çÆ® Æ÷ÀÎÅÍ¸¦ ¸¸µå´Â ±âº»ÀûÀÎ ¿øÄ¢Àº ¼ÒÀ¯±Ç Á¤Ã¥À» ±¸ÇöÇÏ´Â °ÍÀÌ´Ù. Áï, ¾ğÁ¦ ¸Ş·Î¸®¸¦ ÇÒ´çÇÏ°í, ¾ğÁ¦ ¸Ş¸ğ¸®¸¦ ÇØÁ¦ÇÒÁö¿¡ ´ëÇÑ
·ÎÁ÷À» ¸¸µå´Â °ÍÀÌ´Ù. ÀÌ°ÍÀº Æ÷ÀÎÅÍÀÇ »ı¸íÁÖ±â¸¦ °ü¸®ÇÏ´Â ±â´ÉÀ» °®Ãá Å¬·¡½º¸¦ ±¸ÇöÇÔÀ¸·Î½á ´Ş¼º ÇÒ ¼ö ÀÖ´Ù.

°¡Àå ±âº»ÀûÀÎ »ç¿ëÀÚ Á¤ÀÇ ½º¸¶Æ® Æ÷ÀÎÅÍÀÇ ±¸ÇöÀº ´ÙÀ½°ú °°´Ù.

ex)